import * as ort from "onnxruntime-web";
// import { InferenceSession } from "onnxruntime-react-native";
// import { RedisCache } from "./redis/redis.js"
import { Vocabulary } from "./vocabulary.js"

const cache = {
    "arb": ["اے", "اَبائُٹ", "اَبَوَ", "احد", "علل", "عند", "انی", "ارے", "آس", "بِکوَض", "بِلو", "بوت", "بَٹ", "بائيِ", "کنَ", "کريِچَرَ", "ڈِضايَرَ", "دید", "ايوَرِوَنَ", "فھرَسَٹ", "فھورَ", "فھرَوَمَ", "ہوپَنَ", "ہی", "ہی'ایل ایل ", "ہی'ایس", "ہی'ایس نَوَٹ", "ہیرے", "ہیم", "حیس", "ہائُ", "آئی", "آئی 'ڈی", "آئی 'ڈی'وَے", "آئی 'ایل ایل ", "آئی 'ایل ایل 'وَے", "آئی 'ایم", "آئی 'ایم نَوَٹ", "آئی 'وَے", "اِف", "اِن", "اِس", "آئی ٹی 'ایس", "آئی ٹی 'ایس نَوَٹ", "اِٹسَ", "ليِڈرَ", "مے", "مورے", "مائيِ", "نيِڈیڈ", "نمبر", "نو", "اوف", "وَنَسَ", "وَنَ", "اونَليِ", "ئوَرَ", "اوتھر", "آئُارَ", "آئُٹسائِڈ", "سمی", "سیلف", "شَے'ڈی", "شَے'ایل ایل ", "شَے'ایس", "شَے'ایس نَوَٹ", "سومَے", "ٹی", "دَیمَ", "دَینَ", "ٹھیرَے", "دَے", "دَے'ڈی", "دَے'ڈی'وَے", "دَے'ایل ایل ", "دَے'ایل ایل 'وَے", "دَے'رَے", "دَے'رَے نَوَٹ", "دَے'وَے", "تھرُ", "دَض", "ٹو", "اَںٹِلَ", "وَیريِ", "واسَ", "ويِ'ڈی", "ويِ'ڈی'وَے", "ويِ'ایل ایل ", "ويِ'ایل ایل 'وَے", "ويِ'رَے", "ويِ'رَے نَوَٹ", "ويِ'وَے", "وَیںٹ", "وَرَ", "وَوَٹ", "وَینَ", "وَیرَ", "وَیرَوض", "ہُو", "ہُومَ", "وائيِ", "يوُ", "يوُ'ڈی", "يوُ'ڈی'وَے", "يوُ'ایل ایل ", "يوُ'ایل ایل 'وَے", "يوُ'رَے", "يوُ'رَے نَوَٹ", "يوُ'وَے", "اے", "اَبائُٹ", "اَبَوَ", "آفھٹرَ", "اَگَینَ", "اَگَینَسَڈ", "علل", "عام", "اں", "عند", "اَنادَرَ", "انی", "ارے", "اَرَینَ'ٹی", "اَرَینَ'ٹی ", "عت", "بے", "بِکوَض", "بین", "بِفھوَرَ", "بيِئِںگَ", "بِلو", "بِٹوین", "بوت", "بَٹ", "بائيِ", "کنَ", "کنَ'ٹی", "کانّوتَ", "کلوجَ", "کُڈ", "چاُلدن'ٹی", "دید", "ڈی آئی ڈی این 'ٹی", "ڈو", "دوءیس", "ڈی او ای ایس این 'ٹی", "ڈُئِںگَ", "ڈون'ٹی", "دون", "ڈيُارِںگَ", "اِیچَ", "ايٹ", "فھيُ", "فھائِوَ", "فھورَ", "فور", "فھرَوَمَ", "فھرَدَرَ", "حد", "ایچ ﻿اے ڈی این 'ٹی", "حسں", "ہسن'ٹی", "ہووَ", "ہیوَنَ'ٹی", "ہووِںگَ", "ہی'ڈی", "ہی'ایل ایل ", "ہی'ایس", "ہر", "ہیرے", "ہیرے'ایس", "ہرَض", "ہرَسَیلَفھ", "ہیم", "ہِمَسَیلَفھ", "حیس", "ہائُ", "ہائُ'ایس", "آئی", "آئی'ڈی", "آئی'ایل ایل ", "آئی'ایم", "آئی'وَے", "اِف", "اِن", "اِنَسَٹیڈ", "اِںٹُو", "اِس", "آئی ایس این 'ٹی", "آئی ٹی ", "آئی ٹی 'ایس", "اِٹسَ", "اِٹسَیلَفھ", "لیت'ایس", "مَجَوَرِٹی", "مے", "مورے", "موسَٹ", "مَسَٹ", "مُستان'ٹی", "مائيِ", "مائِسَیلَفھ", "نائِدَرَ", "نائِنَ", "نمبر", "نور", "نَوَٹ", "اوف", "ئوَفَ", "اون", "وَنَسَ", "وَنَ", "اونَليِ", "ئوَرَ", "اوتھر", "ئوَٹ", "آوَرَض", "آئُارَسَیلَوَض", "آئُٹ", "اووَرَ", "اونَ", "پسّ", "سمی", "سَیوَینَ", "شَولَ", "شان'ٹی", "شَے", "شَے'ڈی", "شَے'ایل ایل ", "شَے'ایس", "شُڈ", "شاُلدن'ٹی", "سِکسَ", "سو", "سومَے", "سچ", "ٹیکسَٹ", "تھان", "ٹھٹ", "ٹھٹ'ایس", "ٹھی", "دَیرَ", "دَیرَ'ایس", "دَیرَض", "دَیمَ", "دَمَسَیلَوَض", "دَینَ", "ٹھیرَے", "ٹھیرَے'رَے", "ٹھیرَے'ایس", "ٹھیسَے", "دَے", "دَے'ڈی", "دَے'ایل ایل ", "دَے'رَے", "دَے'وَے", "دِسَ", "تھوسَے", "تھريِ", "تھرُ", "ٹو", "ٹو", "ٹُو", "اَنَڈرَ", "اَںٹِلَ", "اوپ", "وَیريِ", "واسَ", "ڈبلیو ﻿اے ایس این 'ٹی", "ويِ", "ويِ'ڈی", "ويِ'ایل ایل ", "ويِ'رَے", "ويِ'وَے", "وَرَ", "وَیرَینَ'ٹی", "وَوَٹ", "وَوَٹ'ایس", "وَینَ", "وَینَ'ایس", "وَیرَ", "وَیرَ'ایس", "وِچَ", "وائِلَ", "ہُو", "ہُو'ایس", "ہُومَ", "وائيِ", "وائيِ'ایس", "وِلَ", "وِتھ", "وَنَ'ٹی", "وُڈ", "واُلدن'ٹی", "يوُ", "يَوَرَ'ایس", "يَوَرَض", "يَوَرَسَیلَفھ", "جھيِرو"],
    "asm": ["আ", "অবাউট", "অবৱ", "অহেড", "অল", "এণ্ড", "অন্য", "আৰে", "আস", "বিকজ়", "বিলো", "বোথ", "বুট", "বাঈ", "ক্যান", "ক্ৰীচৰ", "ডিজ়ায়ৰ", "ডিড", "এৱ্ৰিৱন", "ফাৰ্স্ট", "ফোৰ", "ফ্ৰম", "হ্যাপন", "হী", "হী'এলএল", "হী'এস", "হী'এস নোত", "হেড়ে", "হিম", "হিজ়", "হাউ", "ই", "আই'ডি", "আই'ডি'ৱে", "আই'এলএল", "আই'এলএল'ৱে", "আই'এম", "আই'এম নোত", "আই'ৱে", "ইফ", "ইন", "ইজ়", "আইটি'এস", "আইটি'এস নোত", "ইট্স", "লিডাৰ", "মী", "মোৰে", "মাঈ", "নীডেড", "নো", "নৌ", "অফ", "ৱন্স", "ৱন", "ওন্লী", "অৰ", "অদৰ", "আউঅৰ", "আউট্সাইড", "সমে", "সেল্ফ", "শে'ডি", "শে'এলএল", "শে'এস", "শে'এস নোত", "সোম", "টী", "দেম", "দেন", "থেৰে", "দে", "দে'ডি", "দে'ডি'ৱে", "দে'এলএল", "দে'এলএল'ৱে", "দে'ৰে", "দে'ৰে নোত", "দে'ৱে", "থ্ৰু", "দজ়", "টু", "অণ্টিল", "ৱেৰী", "ওয়াজ", "ৱী'ডি", "ৱী'ডি'ৱে", "ৱী'এলএল", "ৱী'এলএল'ৱে", "ৱী'ৰে", "ৱী'ৰে নোত", "ৱী'ৱে", "ৱেণ্ট", "ৱৰ", "ৱট", "ৱেন", "ৱেৰ", "ৱেৰ্যাজ়", "হূ", "হূম", "ৱাঈ", "যূ", "যূ'ডি", "যূ'ডি'ৱে", "যূ'এলএল", "যূ'এলএল'ৱে", "যূ'ৰে", "যূ'ৰে নোত", "যূ'ৱে", "আ", "অবাউট", "অবৱ", "আফতাৰ", "অগেন", "এগেনস্ট", "অল", "আম", "আন", "এণ্ড", "অনাদৰ", "অন্য", "আৰে", "অৰেন'ত", "অৰেন'ত ", "অ্যাট", "বী", "বিকজ়", "বিন", "বিফৰ", "বীইঙ্গ", "বিলো", "বিট্ৱীন", "বোথ", "বুট", "বাঈ", "ক্যান", "ক্যান'ত", "কান্নোত", "ক্লোজ", "কুড", "কৌল্দ্ন'ত", "ডিড", "ডীআইডীএন'ত", "দও", "দোয়স", "ডীওইএসএন'ত", "ডুইঙ্গ", "ডন'ত", "ডাউন", "ড্যুঅৰিঙ্গ", "এচ", "এট", "ফ্যু", "ফাইভ", "ফোৰ", "ফোৰ", "ফ্ৰম", "ফৰ্দৰ", "হাদ", "এইছএডীএন'ত", "হাস", "এইছএএসএন'ত", "হ্যাভ", "হেৱন'ত", "হ্যাৱিঙ্গ", "হী'ডি", "হী'এলএল", "হী'এস", "হেৰ", "হেড়ে", "হেড়ে'এস", "হৰ্জ়", "হৰ্সেল্ফ", "হিম", "হিমসেল্ফ", "হিজ়", "হাউ", "হাউ'এস", "ই", "ই'ডি", "ই'এলএল", "ই'এম", "ই'ৱে", "ইফ", "ইন", "ইন্সটেড", "ইণ্টূ", "ইজ়", "আইএসএন'ত", "আইটি", "আইটি'এস", "ইট্স", "ইট্সেল্ফ", "লেট'এস", "মজৰিটী", "মী", "মোৰে", "মোস্ট", "মস্ট", "মুস্ট্ন'ত", "মাঈ", "মাইসেল্ফ", "নাইদৰ", "নাইন", "নো", "নৰ", "নোত", "অফ", "অফ়", "অন", "ৱন্স", "ৱন", "ওন্লী", "অৰ", "অদৰ", "অট", "আৱৰ্জ়", "আউঅৰ্সেলৱ্জ়", "আউট", "ওভাৰ", "ওন", "পাস", "সমে", "সেবন", "শ্যাল", "চান'ত", "শে", "শে'ডি", "শে'এলএল", "শে'এস", "শুড", "শৌল্দ্ন'ত", "সিক্স", "সো", "সোম", "সাচ", "টেক্স্ট", "থান", "ঠট", "ঠট'এস", "থে", "দেৰ", "দেৰ'এস", "দেৰ্জ়", "দেম", "দম্সেলৱ্জ়", "দেন", "থেৰে", "থেৰে'ৰে", "থেৰে'এস", "ঠেসে", "দে", "দে'ডি", "দে'এলএল", "দে'ৰে", "দে'ৱে", "দিস", "থোসে", "থ্ৰী", "থ্ৰু", "টু", "টু", "টু", "আন্দাৰ", "অণ্টিল", "অপ", "ৱেৰী", "ওয়াজ", "ডব্লিউএএসএন'ত", "ৱী", "ৱী'ডি", "ৱী'এলএল", "ৱী'ৰে", "ৱী'ৱে", "ৱৰ", "ৱেৰেন'ত", "ৱট", "ৱট'এস", "ৱেন", "ৱেন'এস", "ৱেৰ", "ৱেৰ'এস", "ৱিচ", "ৱাইল", "হূ", "হূ'এস", "হূম", "ৱাঈ", "ৱাঈ'এস", "ৱিল", "ৱিথ", "ৱন'ত", "ৱুড", "ৱৌল্দ্ন'ত", "যূ", "যৰ'এস", "যৰ্জ়", "যৰসেল্ফ", "জিৰো"],
    "ben": ["এ", "অবাউট", "অবও", "অহেড", "অল", "এণ্ড", "অন্য", "আরে", "আস", "বিকজ়", "বিলো", "বোথ", "বাট", "বাঈ", "ক্যান", "ক্রীচর", "ডিজ়ায়র", "ডিড", "এব্রিবন", "ফার্স্ট", "ফ়োর", "ফ্রম", "হ্যাপন", "হী", "হী'এলএল", "হী'এস", "হী'এস নোত", "হেরে", "হিম", "হিজ়", "হৌ", "আই", "আই'দ", "আই'দ'বে", "আই'এলএল", "আই'এলএল'বে", "আই'এম", "আই'এম নোত", "আই'বে", "ইফ", "ইন", "ইজ়", "ইত'এস", "ইত'এস নোত", "ইট্স", "লিডার", "মে", "মোরে", "মাঈ", "নীডেড", "নং", "নৌ", "অফ", "বন্স", "বন", "ওন্লী", "ওর", "অদর", "আউঅর", "আউট্সাইড", "সেম", "সেল্ফ", "শে'দ", "শে'এলএল", "শে'এস", "শে'এস নোত", "সোম", "টী", "থেম", "থেন", "ঠেরে", "দে", "দে'দ", "দে'দ'বে", "দে'এলএল", "দে'এলএল'বে", "দে'রে", "দে'রে নোত", "দে'বে", "থ্রু", "দজ়", "টু", "অণ্টিল", "বেরী", "ওয়াজ", "বী'দ", "বী'দ'বে", "বী'এলএল", "বী'এলএল'বে", "বী'রে", "বী'রে নোত", "বী'বে", "বেণ্ট", "বর", "বট", "বেন", "বের", "বের্যাজ়", "হূ", "হূম", "ওয়াঈ", "যূ", "যূ'দ", "যূ'দ'বে", "যূ'এলএল", "যূ'এলএল'বে", "যূ'রে", "যূ'রে নোত", "যূ'বে", "এ", "অবাউট", "অবও", "আফটার", "অগেন", "এগেনস্ট", "অল", "অম", "অন", "এণ্ড", "অনাদর", "অন্য", "আরে", "অরেন'টি", "অরেন'টি ", "অ্যাট", "বী", "বিকজ়", "বিন", "বিফর", "বীইঙ্গ", "বিলো", "বিট্বীন", "বোথ", "বাট", "বাঈ", "ক্যান", "ক্যান'টি", "কান্নোত", "ক্লোজ", "কুড", "কৌল্দ্ন'টি", "ডিড", "ডিআইডিএন'টি", "দো", "দোয়স", "ডিওইএসএন'টি", "ডুইঙ্গ", "ডন'টি", "ডাউন", "ড্যুঅরিঙ্গ", "ঈচ", "এট", "ফ্যু", "ফাইভ", "ফ়োর", "ফোর", "ফ্রম", "ফর্দর", "হদ", "এইচএডিএন'টি", "হ্যাজ", "এইচএএসএন'টি", "হ্যাভ", "হেবন'টি", "হ্যাবিঙ্গ", "হী'দ", "হী'এলএল", "হী'এস", "হের", "হেরে", "হেরে'এস", "হর্জ়", "হর্সেল্ফ", "হিম", "হিমসেল্ফ", "হিজ়", "হৌ", "হৌ'এস", "আই", "আই'দ", "আই'এলএল", "আই'এম", "আই'বে", "ইফ", "ইন", "ইন্সটেড", "ইণ্টূ", "ইজ়", "আইএসএন'টি", "ইত", "ইত'এস", "ইট্স", "ইট্সেল্ফ", "লেট'এস", "মজরিটী", "মে", "মোরে", "মোস্ট", "মস্ট", "মুস্ট্ন'টি", "মাঈ", "মাইসেল্ফ", "নাইদর", "নাইন", "নং", "নোর", "নোত", "অফ", "অফ়", "ওন", "বন্স", "বন", "ওন্লী", "ওর", "অদর", "অট", "আবর্জ়", "আউঅর্সেলব্জ়", "আউট", "ওভার", "ওন", "পাস", "সেম", "সেবন", "শ্যাল", "শান'টি", "শে", "শে'দ", "শে'এলএল", "শে'এস", "শুড", "শৌল্দ্ন'টি", "সিক্স", "সো", "সোম", "সাচ", "টেক্স্ট", "থান", "ঠট", "ঠট'এস", "দ", "দের", "দের'এস", "দের্জ়", "থেম", "দম্সেলব্জ়", "থেন", "ঠেরে", "ঠেরে'রে", "ঠেরে'এস", "ঠেসে", "দে", "দে'দ", "দে'এলএল", "দে'রে", "দে'বে", "দিস", "থোসে", "থ্রী", "থ্রু", "টু", "টু", "টু", "অন্ডর", "অণ্টিল", "অপ", "বেরী", "ওয়াজ", "ডব্লিউএএসএন'টি", "বী", "বী'দ", "বী'এলএল", "বী'রে", "বী'বে", "বর", "বেরেন'টি", "বট", "বট'এস", "বেন", "বেন'এস", "বের", "বের'এস", "বিচ", "ওয়াইল", "হূ", "হূ'এস", "হূম", "ওয়াঈ", "ওয়াঈ'এস", "বিল", "বিথ", "বন'টি", "বুড", "বৌল্দ্ন'টি", "যূ", "যর'এস", "যর্জ়", "যরসেল্ফ", "জিরো"],
    "eng": [
        "a",
        "about",
        "above",
        "ahead",
        "all",
        "and",
        "any",
        "are",
        "as",
        "because",
        "below",
        "both",
        "but",
        "by",
        "can",
        "creature",
        "desire",
        "did",
        "everyone",
        "first",
        "for",
        "from",
        "happen",
        "he",
        "he'll",
        "he's",
        "he's not",
        "here",
        "him",
        "his",
        "how",
        "i",
        "i'd",
        "i'd've",
        "i'll",
        "i'll've",
        "i'm",
        "i'm not",
        "i've",
        "if",
        "in",
        "is",
        "it's",
        "it's not",
        "its",
        "leader",
        "me",
        "more",
        "my",
        "needed",
        "no",
        "now",
        "of",
        "once",
        "one",
        "only",
        "or",
        "other",
        "our",
        "outside",
        "same",
        "self",
        "she'd",
        "she'll",
        "she's",
        "she's not",
        "some",
        "tea",
        "them",
        "then",
        "there",
        "they",
        "they'd",
        "they'd've",
        "they'll",
        "they'll've",
        "they're",
        "they're not",
        "they've",
        "through",
        "thus",
        "to",
        "until",
        "very",
        "was",
        "we'd",
        "we'd've",
        "we'll",
        "we'll've",
        "we're",
        "we're not",
        "we've",
        "went",
        "were",
        "what",
        "when",
        "where",
        "whereas",
        "who",
        "whom",
        "why",
        "you",
        "you'd",
        "you'd've",
        "you'll",
        "you'll've",
        "you're",
        "you're not",
        "you've",
        "a",
        "about",
        "above",
        "after",
        "again",
        "against",
        "all",
        "am",
        "an",
        "and",
        "another",
        "any",
        "are",
        "aren't",
        "aren't ",
        "at",
        "be",
        "because",
        "been",
        "before",
        "being",
        "below",
        "between",
        "both",
        "but",
        "by",
        "can",
        "can't",
        "cannot",
        "close",
        "could",
        "couldn't",
        "did",
        "didn't",
        "do",
        "does",
        "doesn't",
        "doing",
        "don't",
        "down",
        "during",
        "each",
        "eight",
        "few",
        "five",
        "for",
        "four",
        "from",
        "further",
        "had",
        "hadn't",
        "has",
        "hasn't",
        "have",
        "haven't",
        "having",
        "he'd",
        "he'll",
        "he's",
        "her",
        "here",
        "here's",
        "hers",
        "herself",
        "him",
        "himself",
        "his",
        "how",
        "how's",
        "i",
        "i'd",
        "i'll",
        "i'm",
        "i've",
        "if",
        "in",
        "instead",
        "into",
        "is",
        "isn't",
        "it",
        "it's",
        "its",
        "itself",
        "let's",
        "majority",
        "me",
        "more",
        "most",
        "must",
        "mustn't",
        "my",
        "myself",
        "neither",
        "nine",
        "no",
        "nor",
        "not",
        "of",
        "off",
        "on",
        "once",
        "one",
        "only",
        "or",
        "other",
        "ought",
        "ours",
        "ourselves",
        "out",
        "over",
        "own",
        "pass",
        "same",
        "seven",
        "shall",
        "shan't",
        "she",
        "she'd",
        "she'll",
        "she's",
        "should",
        "shouldn't",
        "six",
        "so",
        "some",
        "such",
        "text",
        "than",
        "that",
        "that's",
        "the",
        "their",
        "their's",
        "theirs",
        "them",
        "themselves",
        "then",
        "there",
        "there're",
        "there's",
        "these",
        "they",
        "they'd",
        "they'll",
        "they're",
        "they've",
        "this",
        "those",
        "three",
        "through",
        "to",
        "too",
        "two",
        "under",
        "until",
        "up",
        "very",
        "was",
        "wasn't",
        "we",
        "we'd",
        "we'll",
        "we're",
        "we've",
        "were",
        "weren't",
        "what",
        "what's",
        "when",
        "when's",
        "where",
        "where's",
        "which",
        "while",
        "who",
        "who's",
        "whom",
        "why",
        "why's",
        "will",
        "with",
        "won't",
        "would",
        "wouldn't",
        "you",
        "your's",
        "yours",
        "yourself",
        "zero"
    ],
    "hin": ["ए", "अबाउट", "अबव", "अहेड", "ऑल", "एंड", "अन्य", "आर", "एस", "बिकॉज़", "बिलो", "बोथ", "बट", "बाई", "केन", "क्रीचर", "डिज़ायर", "दिद", "एव्रिवन", "फर्स्ट", "फॉर", "फ्रॉम", "हॅपन", "ही", "ही'एलएल", "ही'एस", "ही'एस नोट", "हियर", "हिम", "हिज़", "हाउ", "आई", "आई'डी", "आई'डी'वे", "आई'एलएल", "आई'एलएल'वे", "आई'एम", "आई'एम नोट", "आई'वे", "इफ", "इन", "इज़", "इट'स", "इट'स नोट", "इट्स", "लीडर", "मी", "मोर", "माई", "नीडेड", "नं", "नाउ", "ऑफ", "वन्स", "वन", "ओन्ली", "ऑर", "अदर", "आउअर", "आउट्साइड", "सेम", "सेल्फ", "शि'डी", "शि'एलएल", "शि'स", "शि'स नोट", "सम", "टी", "देम", "देन", "देयर", "दे", "दे'डी", "दे'डी'वे", "दे'एलएल", "दे'एलएल'वे", "दे'रे", "दे'रे नोट", "दे'वे", "थ्रु", "दज़", "टु", "अंटिल", "वेरी", "वास", "वी'डी", "वी'डी'वे", "वी'एलएल", "वी'एलएल'वे", "वी'रे", "वी'रे नोट", "वी'वे", "वेंट", "वर", "वॉट", "वेन", "वेयर", "वॅरॅज़", "हू", "हूम", "वाय", "यू", "यू'डी", "यू'डी'वे", "यू'एलएल", "यू'एलएल'वे", "यू'रे", "यू'रे नोट", "यू'वे", "ए", "अबाउट", "अबव", "अफ़्टर", "अगेन", "अगेन्स्ड", "ऑल", "एम", "एन", "एंड", "अनादर", "एनी", "आर", "अरन'टी", "अरन'टी ", "एट", "बी", "बिकॉज़", "बीन", "बिफॉर", "बीइंग", "बिलो", "बिट्वीन", "बोथ", "बट", "बाय", "केन", "केन'टी", "केन्नोट", "क्लोज", "कुड", "कौल्द्न'टी", "डिड", "डिडन'टी", "डू", "डज", "डज'टी", "डुइंग", "डॉन'टी", "डाउन", "दूरिंग", "ईच", "एट", "फ्यु", "फाइव", "फोर", "फोर", "फ्रॉम", "फर्धर", "हेड", "हेडन'टी", "हेज़", "हेज़न'टी", "हेव", "हेवन'टी", "हेविंग", "ही'डी", "ही'एलएल", "ही'स", "हर", "हियर", "हियर'एस", "हर्ज़", "हर्सेल्फ", "हिम", "हिमसेल्फ", "हिज़", "हाउ", "हाउ'एस", "आई", "आई'डी", "आई'एलएल", "आई'एम", "आई'वे", "इफ", "इन", "इन्सटेड", "इंटू", "इज़", "इज़'ट", "इट", "इट'स", "इट्स", "इट्सेल्फ", "लेट'स", "मजॉरिटी", "मी", "मोर", "मोस्ट", "मस्ट", "मस्ट्न'ट", "माई", "माइसेल्फ", "नाइदर", "नाइन", "नो", "नोर", "नॉट", "ऑफ", "ऑफ", "ऑन", "वन्स", "वन", "ओन्ली", "ऑर", "अदर", "ऑट", "आवर्ज़", "आउअर्सेलव्ज़", "आउट", "ओवर", "ओन", "पास", "सेम", "सेवेन", "शॅल", "शान'टी", "शी", "शी'डी", "शी'एलएल", "शी'एस", "शुड", "शुड'टी", "सिक्स", "सौ", "सम", "सच", "टेक्स्ट", "देन", "देट", "देट'एस", "द", "देयर", "देयर'एस", "धॅर्ज़", "देम", "धम्सेलव्ज़", "देन", "देयर", "देयर'रे", "देयर'एस", "दिइस", "दे", "दे'डी", "दे'एलएल", "दे'रे", "दे'वे", "दिस", "दोज़", "थ्री", "थ्रु", "टु", "टू", "टु", "अन्डर", "अंटिल", "अप", "वेरी", "वास", "वासन'टी", "वी", "वी'डी", "वी'एलएल", "वी'रे", "वी'वे", "वर", "वरन'टी", "वॉट", "वॉट'एस", "वेन", "वेन'एस", "वेयर", "वेयर'एस", "विच", "वाइल", "हू", "हू'एस", "हूम", "वाय", "वाय'एस", "विल", "विथ", "वोन'टी", "वुड", "वुडन'टी", "यू", "यॉर'एस", "यॉर्ज़", "यॉरसेल्फ", "ज़ीरो"],
    "guj": ["એ", "અબાઉટ", "અબવ", "અહેડ", "ઑલ", "એણ્દ", "અન્ય", "આરે", "એએસ", "બિકૉજ", "બિલો", "બોથ", "બટ", "બાઈ", "કન", "ક્રીચર", "ડિજાયર", "ડિડ", "એવ્રિવન", "ફર્સ્ટ", "ફોર", "ફ્રૉમ", "હૅપન", "હી", "હી'એલએલ", "હી'એસ", "હી'એસ નૉટ", "હેરે", "હિમ", "હિજ", "હાઉ", "આઈ", "આઇ'ડી", "આઇ'ડી'વે", "આઇ'એલએલ", "આઇ'એલએલ'વે", "આઇ'એમ", "આઇ'એમ નૉટ", "આઇ'વે", "ઇફ", "ઇન", "ઇજ", "આઇટી'એસ", "આઇટી'એસ નૉટ", "ઇટ્સ", "લીડર", "મી", "મોરે", "માઈ", "નીડેડ", "નો", "નૌ", "ઑફ", "વન્સ", "વન", "ઓન્લી", "ઑર", "અદર", "આઉઅર", "આઉટ્સાઇડ", "સામે", "સેલ્ફ", "શે'ડી", "શે'એલએલ", "શે'એસ", "શે'એસ નૉટ", "સોમે", "ટી", "દેમ", "દેન", "ઠેરે", "દે", "દે'ડી", "દે'ડી'વે", "દે'એલએલ", "દે'એલએલ'વે", "દે'રે", "દે'રે નૉટ", "દે'વે", "થ્રુ", "દજ", "ટુ", "અંટિલ", "વેરી", "વાસ", "વી'ડી", "વી'ડી'વે", "વી'એલએલ", "વી'એલએલ'વે", "વી'રે", "વી'રે નૉટ", "વી'વે", "વેંટ", "વર", "વૉટ", "વેન", "વેર", "વેરૅજ", "હૂ", "હૂમ", "વાઈ", "યૂ", "યૂ'ડી", "યૂ'ડી'વે", "યૂ'એલએલ", "યૂ'એલએલ'વે", "યૂ'રે", "યૂ'રે નૉટ", "યૂ'વે", "એ", "અબાઉટ", "અબવ", "આફ્ટર", "અગેન", "અગેન્સ્ડ", "ઑલ", "આમ", "આન", "એણ્દ", "અનાદર", "અન્ય", "આરે", "અરેન'ટી", "અરેન'ટી ", "ઍટ", "બી", "બિકૉજ", "બીન", "બિફૉર", "બીઇંગ", "બિલો", "બિટ્વીન", "બોથ", "બટ", "બાઈ", "કન", "કન'ટી", "કાન્નોત", "ક્લોજ", "કુડ", "કૌલ્દ્ન'ટી", "ડિડ", "ડીઆઇડીએન'ટી", "ડૂ", "દોયસ", "ડીઓઇએસએન'ટી", "ડુઇંગ", "દોણ'ટી", "ડાઉન", "ડ્યુઅરિંગ", "ઈચ", "એટ", "ફ્યુ", "ફાઈવ", "ફોર", "ફોર", "ફ્રૉમ", "ફર્દર", "હડ", "એચએડીએન'ટી", "હાસ", "એચએએસએન'ટી", "હવે", "હેવન'ટી", "હૅવિંગ", "હી'ડી", "હી'એલએલ", "હી'એસ", "હેર", "હેરે", "હેરે'એસ", "હર્જ", "હર્સેલ્ફ", "હિમ", "હિમસેલ્ફ", "હિજ", "હાઉ", "હાઉ'એસ", "આઈ", "આઈ'ડી", "આઈ'એલએલ", "આઈ'એમ", "આઈ'વે", "ઇફ", "ઇન", "ઇન્સટેડ", "ઇંટૂ", "ઇજ", "આઇએસએન'ટી", "આઇટી", "આઇટી'એસ", "ઇટ્સ", "ઇટ્સેલ્ફ", "લૈટ'એસ", "મજૉરિટી", "મી", "મોરે", "મોસ્ટ", "મસ્ટ", "મુસ્ટ્ન'ટી", "માઈ", "માઇસેલ્ફ", "નાઇદર", "નાઇન", "નો", "નોર", "નૉટ", "ઑફ", "ઑફ", "ઑન", "વન્સ", "વન", "ઓન્લી", "ઑર", "અદર", "ઑટ", "આવર્જ", "આઉઅર્સેલવ્જ", "આઉટ", "ઓવર", "ઓન", "પાસ", "સામે", "સેવન", "શૅલ", "શાન'ટી", "શે", "શે'ડી", "શે'એલએલ", "શે'એસ", "શુડ", "શૌલ્દ્ન'ટી", "સિક્સ", "સો", "સોમે", "સચ", "ટેક્સ્ટ", "થાણ", "ઠટ", "ઠટ'એસ", "ઠે", "દેર", "દેર'એસ", "દેર્જ", "દેમ", "દમ્સેલવ્જ", "દેન", "ઠેરે", "ઠેરે'રે", "ઠેરે'એસ", "ઠેસે", "દે", "દે'ડી", "દે'એલએલ", "દે'રે", "દે'વે", "દિસ", "થોસે", "તીન", "થ્રુ", "ટુ", "ટુ", "ટૂ", "અન્ડર", "અંટિલ", "અપ", "વેરી", "વાસ", "ડબલયૂએએસએન'ટી", "વી", "વી'ડી", "વી'એલએલ", "વી'રે", "વી'વે", "વર", "વેરેન'ટી", "વૉટ", "વૉટ'એસ", "વેન", "વેન'એસ", "વેર", "વેર'એસ", "વિચ", "વાઇલ", "હૂ", "હૂ'એસ", "હૂમ", "વાઈ", "વાઈ'એસ", "વિલ", "વિથ", "વન'ટી", "વુડ", "વૌલ્દ્ન'ટી", "યૂ", "યૉર'એસ", "યૉર્જ", "યૉરસેલ્ફ", "જીરો"],
    "kan": ["ಎ", "ಅಬೌಟ್", "ಅಬವ", "ಅಹೆಡ್", "ಅಲ್ಲಾ", "ಆನಂದ್", "ಎನಿ", "ಆರೆ", "ಅಸ್", "ಬೆಕಾಜ್", "ಬಿಲೊ", "ಬೊತ್", "ಬಟ್", "ಬೈ", "ಕ್ಯಾನ್", "ಕ್ರೀಟ್ಯೂರ್", "ಡಿಜೈರ್", "ಡಿಡ್", "ಎವೆರೊನ್", "ಫರ್ಸ್ಟ್", "ಫೊರ್", "ಫ್ರಮ್", "ಹಾಪನ್", "ಹಿ", "ಹಿ'ಎಲ್ಎಲ್", "ಹಿ'ಎಸ್", "ಹಿ'ಎಸ್ ನಾಟ್", "ಹಿಯರ್", "ಹಿಂ", "ಹಿಜ್", "ಹೌ", "ಆಈ", "ಐ'ಡಿ", "ಐ'ಡಿ'ವೇ", "ಐ'ಎಲ್ಎಲ್", "ಐ'ಎಲ್ಎಲ್'ವೇ", "ಐ'ಎಂ", "ಐ'ಎಂ ನಾಟ್", "ಐ'ವೇ", "ಇಫ್", "ಇನ್", "ಇಜ್", "ಐಟಿ'ಎಸ್", "ಐಟಿ'ಎಸ್ ನಾಟ್", "ಇಟ್ಸ್", "ಲೀಡರ್", "ಮೇ", "ಮೊರೆ", "ಮೈ", "ನೀಡಡ್", "ನಂ", "ನೌ", "ಆಫ್", "ಒನ್ಸ್", "ವನ್", "ಒನ್ಲಿ", "ಒರ್", "ಅದರ್", "ಅವರ್", "ಒಯುತ್ಸೈಡ್", "ಸೇಮ್", "ಸೆಲ್ಫ್", "ಷಿ'ಡಿ", "ಷಿ'ಎಲ್ಎಲ್", "ಷಿ'ಎಸ್", "ಷಿ'ಎಸ್ ನಾಟ್", "ಸಮ್", "ಟಿ", "ದೆಮ್", "ದೆನ್", "ಥೆರ್", "ದೇ", "ದೇ'ಡಿ", "ದೇ'ಡಿ'ವೇ", "ದೇ'ಎಲ್ಎಲ್", "ದೇ'ಎಲ್ಎಲ್'ವೇ", "ದೇ'ರೇ", "ದೇ'ರೇ ನಾಟ್", "ದೇ'ವೇ", "ತ್ರೂ", "ದಜ್", "ಟು", "ಅಂಟಿಲ್", "ವರಿ", "ವಜ್", "ವಿ'ಡಿ", "ವಿ'ಡಿ'ವೇ", "ವಿ'ಎಲ್ಎಲ್", "ವಿ'ಎಲ್ಎಲ್'ವೇ", "ವಿ'ರೇ", "ವಿ'ರೇ ನಾಟ್", "ವಿ'ವೇ", "ವೆಂಟ್", "ವರ್", "ವಾಟ್", "ವೆನ್", "ವೇರ್", "ವೆರೀಸ್", "ಹೂ", "ಹೂಮ್", "ವೈ", "ಯು", "ಯು'ಡಿ", "ಯು'ಡಿ'ವೇ", "ಯು'ಎಲ್ಎಲ್", "ಯು'ಎಲ್ಎಲ್'ವೇ", "ಯು'ರೇ", "ಯು'ರೇ ನಾಟ್", "ಯು'ವೇ", "ಎ", "ಅಬೌಟ್", "ಅಬವ", "ಅಫಟರ್", "ಅಗೈನ್", "ಅಗೆಯಿನ್ಸ್ಟ್", "ಅಲ್ಲಾ", "ಅಮ್", "ಅನ್", "ಆನಂದ್", "ಅನದರ್", "ಎನಿ", "ಆರೆ", "ಅರೇನ್'ಟಿ", "ಅರೇನ್'ಟಿ ", "ಏಟ್", "ಬೇ", "ಬೆಕಾಜ್", "ಬೀನ್", "ಬಿಫೊರ್", "ಬೀಂಗ್", "ಬಿಲೊ", "ಬಿಟ್ವೀನ್", "ಬೊತ್", "ಬಟ್", "ಬೈ", "ಕ್ಯಾನ್", "ಕ್ಯಾನ್'ಟಿ", "ಕಾನೊಟ್", "ಕ್ಲೊಜ್", "ಕುಡ್", "ಕೌಲ್ದ್ನ್'ಟಿ", "ಡಿಡ್", "ಡಿಐಡಿಎನ್'ಟಿ", "ದೊ", "ಡಜ್", "ಡಿಒಈಎಸ್ಎನ್'ಟಿ", "ಡೂಯಿಂಗ್", "ಡನ್'ಟಿ", "ಡೌನ್", "ಡುರಿಂಗ್", "ಈಚ್", "ಎಯಿಟ್", "ಫ್ಯೂ", "ಫೈವ್", "ಫೊರ್", "ಫೊರ್", "ಫ್ರಮ್", "ಫುರ್ತರ್", "ಹಾಡ್", "ಹೆಚಎಡಿಎನ್'ಟಿ", "ಹಾಜ್", "ಹಸ್ನ್'ಟಿ", "ಹಾವ್", "ಹವೆನ್'ಟಿ", "ಹಾವಿಂಗ್", "ಹಿ'ಡಿ", "ಹಿ'ಎಲ್ಎಲ್", "ಹಿ'ಎಸ್", "ಹರ್", "ಹಿಯರ್", "ಹಿಯರ್'ಎಸ್", "ಹರ್ಸ್", "ಹೆರ್ಸೆಲ್ಫ್", "ಹಿಂ", "ಹಿಮಸೆಲ್ಫ್", "ಹಿಜ್", "ಹೌ", "ಹೌ'ಎಸ್", "ಆಈ", "ಆಈ'ಡಿ", "ಆಈ'ಎಲ್ಎಲ್", "ಆಈ'ಎಂ", "ಆಈ'ವೇ", "ಇಫ್", "ಇನ್", "ಇನ್‌ಸ್ಟೀಡ್", "ಇಂಟು", "ಇಜ್", "ಐಎಸ್ಎನ್'ಟಿ", "ಐಟಿ", "ಐಟಿ'ಎಸ್", "ಇಟ್ಸ್", "ಇತ್ಸೆಲ್ಫ್", "ಲೆಟ್'ಎಸ್", "ಮಾಜೊರಿಟಿ", "ಮೇ", "ಮೊರೆ", "ಮೊಸ್ಟ್", "ಮಸ್ಟ್", "ಮುಸ್ಟ್ನ್'ಟಿ", "ಮೈ", "ಮಿಸೆಲ್ಫ್", "ನೈದರ್", "ನೈನ್", "ನಂ", "ನಾರ್", "ನಾಟ್", "ಆಫ್", "ಆಫ್", "ಒನ್", "ಒನ್ಸ್", "ವನ್", "ಒನ್ಲಿ", "ಒರ್", "ಅದರ್", "ಆಟ್", "ಅವರ್ಸ್", "ಅವರ್‌ಸೆಲ್ವ್ಸ್", "ಔಟ್", "ಒವರ್", "ಒನ್", "ಪಾಸ್", "ಸೇಮ್", "ಸೆವನ್", "ಷಲ್", "ಶಾನ್'ಟಿ", "ಷಿ", "ಷಿ'ಡಿ", "ಷಿ'ಎಲ್ಎಲ್", "ಷಿ'ಎಸ್", "ಷುಡ್", "ಶೌಲ್ದ್ನ್'ಟಿ", "ಸಿಕ್ಸ್", "ಸೊ", "ಸಮ್", "ಸಚ್", "ಟೆಕ್ಸ್ಟ್", "ದೇನ್", "ದಟ್", "ದಟ್'ಎಸ್", "ದಿ", "ದೆಯಿರ್", "ದೆಯಿರ್'ಎಸ್", "ಥೈರ್ಸ್", "ದೆಮ್", "ಥೆಮಸೆಲ್ವೆಸ್", "ದೆನ್", "ಥೆರ್", "ಥೆರ್'ರೇ", "ಥೆರ್'ಎಸ್", "ದೀಜ್", "ದೇ", "ದೇ'ಡಿ", "ದೇ'ಎಲ್ಎಲ್", "ದೇ'ರೇ", "ದೇ'ವೇ", "ಥಿಸ್", "ದೊಜ್", "ಥ್ರಿ", "ತ್ರೂ", "ಟು", "ಟೂ", "ಟೂ", "ಅಂಡರ್", "ಅಂಟಿಲ್", "ಅಪ್", "ವರಿ", "ವಜ್", "ಡಬಲಯೂಎಎಸ್ಎನ್'ಟಿ", "ವಿ", "ವಿ'ಡಿ", "ವಿ'ಎಲ್ಎಲ್", "ವಿ'ರೇ", "ವಿ'ವೇ", "ವರ್", "ವೇರೇನ್'ಟಿ", "ವಾಟ್", "ವಾಟ್'ಎಸ್", "ವೆನ್", "ವೆನ್'ಎಸ್", "ವೇರ್", "ವೇರ್'ಎಸ್", "ವಿಚ್", "ವೈಲ್", "ಹೂ", "ಹೂ'ಎಸ್", "ಹೂಮ್", "ವೈ", "ವೈ'ಎಸ್", "ವಿಲ್", "ವಿತ್", "ವನ್'ಟಿ", "ವುಡ್", "ವೌಲ್ದ್ನ್'ಟಿ", "ಯು", "ಯೌರ್'ಎಸ್", "ಯುವರ್ಸ್", "ಯೊರ್ಸೆಲ್ಫ್", "ಝೀರೊ"],
    "pan": ["ਏ", "ਅਬਾਉਟ", "ਅਬਵ", "ਅਹੇਡ", "ਆਲ", "ਏਂਡ", "ਅਨ੍ਯ", "ਆਰੇ", "ਏਏਸ", "ਬਿਕçਜ਼", "ਬਿਲੋ", "ਬੋਥ", "ਬੱਟ", "ਬਾਈ", "ਕਨ", "ਕ੍ਰੀਚਰ", "ਡਿਜ਼ਾਯਰ", "ਡਿਡ", "ਏਵ੍ਰਿਵਨ", "ਫਰ੍ਸ੍ਟ", "ਫੋਰ", "ਫ਼੍ਰੋਮ", "ਹãਪਨ", "ਹੀ", "ਹੀ'ਏਲਏਲ", "ਹੀ'ਐਸ", "ਹੀ'ਐਸ ਨçਟ", "ਹੇਰੇ", "ਹਿਮ", "ਹਿਜ਼", "ਹਾਉ", "ਕੋਲਨੀ,ਆਈ", "ਆਇ'ਡੀ", "ਆਇ'ਡੀ'ਵੇ", "ਆਇ'ਏਲਏਲ", "ਆਇ'ਏਲਏਲ'ਵੇ", "ਆਇ'ਐਮ", "ਆਇ'ਐਮ ਨçਟ", "ਆਇ'ਵੇ", "ਇਫ", "ਇਨ", "ਇਜ਼", "ਆਇਟੀ'ਐਸ", "ਆਇਟੀ'ਐਸ ਨçਟ", "ਇਟ੍ਸ", "ਲੀਡਰ", "ਮੀ", "ਮੋਰੇ", "ਮਾਈ", "ਨੀਡੇਡ", "ਨੰ", "ਨੌ", "ਆਫ਼", "ਵਨ੍ਸ", "ਵਨ", "ਓਨ੍ਲੀ", "²ਰ", "ਅਦਰ", "ਆਉਅਰ", "ਆਉਟ੍ਸਾਇਡ", "ਸਮੇ", "ਸੇਲ੍ਫ", "ਸ਼ੇ'ਡੀ", "ਸ਼ੇ'ਏਲਏਲ", "ਸ਼ੇ'ਐਸ", "ਸ਼ੇ'ਐਸ ਨçਟ", "ਸੋਮੇ", "ਟੀ", "ਦੇਮ", "ਦੇਨ", "ਠੇਰੇ", "ਦੇ", "ਦੇ'ਡੀ", "ਦੇ'ਡੀ'ਵੇ", "ਦੇ'ਏਲਏਲ", "ਦੇ'ਏਲਏਲ'ਵੇ", "ਦੇ'ਰੇ", "ਦੇ'ਰੇ ਨçਟ", "ਦੇ'ਵੇ", "ਥ੍ਰੁ", "ਦਜ਼", "ਟੁ", "ਅਂਟਿਲ", "ਵੇਰੀ", "ਵਾਸ", "ਵੀ'ਡੀ", "ਵੀ'ਡੀ'ਵੇ", "ਵੀ'ਏਲਏਲ", "ਵੀ'ਏਲਏਲ'ਵੇ", "ਵੀ'ਰੇ", "ਵੀ'ਰੇ ਨçਟ", "ਵੀ'ਵੇ", "ਵੇਂਟ", "ਵਰ", "ਵçਟ", "ਵੇਨ", "ਵੇਰ", "ਵੇਰãਜ਼", "ਹੂ", "ਹੂਮ", "ਵਾਈ", "ਯੂ", "ਯੂ'ਡੀ", "ਯੂ'ਡੀ'ਵੇ", "ਯੂ'ਏਲਏਲ", "ਯੂ'ਏਲਏਲ'ਵੇ", "ਯੂ'ਰੇ", "ਯੂ'ਰੇ ਨçਟ", "ਯੂ'ਵੇ", "ਏ", "ਅਬਾਉਟ", "ਅਬਵ", "ਆਫ੍ਟਰ", "ਅਗੇਨ", "ਅਗੇਨ੍ਸ੍ਡ", "ਆਲ", "ਆਮ", "ਆਨ", "ਏਂਡ", "ਅਨਾਦਰ", "ਅਨ੍ਯ", "ਆਰੇ", "ਅਰੇਨ'ਟੀ", "ਅਰੇਨ'ਟੀ ", "®ਟ", "ਬੀ", "ਬਿਕçਜ਼", "ਬੀਨ", "ਬਿਫçਰ", "ਬੀਇੰਗ", "ਬਿਲੋ", "ਬਿਟ੍ਵੀਨ", "ਬੋਥ", "ਬੱਟ", "ਬਾਈ", "ਕਨ", "ਕਨ'ਟੀ", "ਕਾੱਨੋਤ", "ਕ੍ਲੋਜ", "ਕੁਡ", "ਕੌਲ੍ਦ੍ਨ'ਟੀ", "ਡਿਡ", "ਡੀਆਇਡੀਏਨ'ਟੀ", "ਡੂ", "ਦੋਯਸ", "ਡੀਓਇਏਸਏਨ'ਟੀ", "ਡੁਇੰਗ", "ਡੋਣ'ਟੀ", "ਡਾਉਨ", "ਡ੍ਯੁਅਰਿੰਗ", "ਈਚ", "ਏਟ", "ਫ੍ਯੁ", "ਫਾਇਵ", "ਫੋਰ", "ਫੋਰ", "ਫ਼੍ਰੋਮ", "ਫਰ੍ਦਰ", "ਹਡ", "ਏਚਏਡੀਏਨ'ਟੀ", "ਹãਜ਼", "ਏਚਏਏਸਏਨ'ਟੀ", "ਹãਵ", "ਹੇਵਨ'ਟੀ", "ਹãਵਿੰਗ", "ਹੀ'ਡੀ", "ਹੀ'ਏਲਏਲ", "ਹੀ'ਐਸ", "ਹੇਰ", "ਹੇਰੇ", "ਹੇਰੇ'ਐਸ", "ਹਰ੍ਜ਼", "ਹਰ੍ਸੇਲ੍ਫ", "ਹਿਮ", "ਹਿਮਸੇਲ੍ਫ", "ਹਿਜ਼", "ਹਾਉ", "ਹਾਉ'ਐਸ", "ਕੋਲਨੀ,ਆਈ", "ਕੋਲਨੀ,ਆਈ'ਡੀ", "ਕੋਲਨੀ,ਆਈ'ਏਲਏਲ", "ਕੋਲਨੀ,ਆਈ'ਐਮ", "ਕੋਲਨੀ,ਆਈ'ਵੇ", "ਇਫ", "ਇਨ", "ਇਨ੍ਸਟੇਡ", "ਇੰਟੂ", "ਇਜ਼", "ਆਇਏਸਏਨ'ਟੀ", "ਆਇਟੀ", "ਆਇਟੀ'ਐਸ", "ਇਟ੍ਸ", "ਇਟ੍ਸੇਲ੍ਫ", "ਲੈਟ'ਐਸ", "ਮਜçਰਿਟੀ", "ਮੀ", "ਮੋਰੇ", "ਮੋਸ੍ਟ", "ਮਸ੍ਟ", "ਮੁਸ੍ਟ੍ਨ'ਟੀ", "ਮਾਈ", "ਮਾਇਸੇਲ੍ਫ", "ਨਾਇਦਰ", "ਨਾਇਨ", "ਨੰ", "ਨੋਰ", "ਨçਟ", "ਆਫ਼", "²ਫ਼", "²ਨ", "ਵਨ੍ਸ", "ਵਨ", "ਓਨ੍ਲੀ", "²ਰ", "ਅਦਰ", "²ਟ", "ਆਵਰ੍ਜ਼", "ਆਉਅਰ੍ਸੇਲਵ੍ਜ਼", "ਔਤ", "ਓਵਰ", "ਓਨ", "ਪਾਸ", "ਸਮੇ", "ਸੇਵੇਨ", "ਸ਼ãਲ", "ਸ਼ਨ'ਟੀ", "ਸ਼ੇ", "ਸ਼ੇ'ਡੀ", "ਸ਼ੇ'ਏਲਏਲ", "ਸ਼ੇ'ਐਸ", "ਸ਼ੁਡ", "ਸ਼ੌਲ੍ਦ੍ਨ'ਟੀ", "ਸਿਕ੍ਸ", "ਸੋ", "ਸੋਮੇ", "ਸਚ", "ਟੇਕ੍ਸ੍ਟ", "ਥਾਨ", "ਠਟ", "ਠਟ'ਐਸ", "ਦ", "ਦੇਰ", "ਦੇਰ'ਐਸ", "ਦੇਰ੍ਜ਼", "ਦੇਮ", "ਦਮ੍ਸੇਲਵ੍ਜ਼", "ਦੇਨ", "ਠੇਰੇ", "ਠੇਰੇ'ਰੇ", "ਠੇਰੇ'ਐਸ", "ਠੇਸੇ", "ਦੇ", "ਦੇ'ਡੀ", "ਦੇ'ਏਲਏਲ", "ਦੇ'ਰੇ", "ਦੇ'ਵੇ", "ਦਿਸ", "ਥੋਸੇ", "ਥ੍ਰੀ", "ਥ੍ਰੁ", "ਟੁ", "ਟੁ", "ਟੂ", "ਅਨ੍ਡਰ", "ਅਂਟਿਲ", "ਅਪ", "ਵੇਰੀ", "ਵਾਸ", "ਡਬਲਯੂਏਏਸਏਨ'ਟੀ", "ਵੀ", "ਵੀ'ਡੀ", "ਵੀ'ਏਲਏਲ", "ਵੀ'ਰੇ", "ਵੀ'ਵੇ", "ਵਰ", "ਵੇਰੇਨ'ਟੀ", "ਵçਟ", "ਵçਟ'ਐਸ", "ਵੇਨ", "ਵੇਨ'ਐਸ", "ਵੇਰ", "ਵੇਰ'ਐਸ", "ਵਿਚ", "ਵਾਇਲ", "ਹੂ", "ਹੂ'ਐਸ", "ਹੂਮ", "ਵਾਈ", "ਵਾਈ'ਐਸ", "ਵਿਲ", "ਵਿਥ", "ਵਨ'ਟੀ", "ਵੁਡ", "ਵੌਲ੍ਦ੍ਨ'ਟੀ", "ਯੂ", "ਯçਰ'ਐਸ", "ਯçਰ੍ਜ਼", "ਯçਰਸੇਲ੍ਫ", "ਝੀਰੋ"],
    "mar": ["ए", "अबाउट", "अबव", "अहेड", "ऑल", "एंड", "अन्य", "आर", "एस", "बिकॉज़", "बिलो", "बोथ", "बट", "बाई", "केन", "क्रीचर", "डिज़ायर", "डिड", "एव्रिवन", "फर्स्ट", "फोर", "फ्रॉम", "हॅपन", "ही", "ही'एलएल", "ही'एस", "ही'एस नोट", "हियर", "हिम", "हिज़", "हाउ", "आई", "आई'डी", "आई'डी'वे", "आई'एलएल", "आई'एलएल'वे", "आई'एम", "आई'एम नॉट", "आई'वे", "इफ", "इन", "इज़", "इट'स", "इट'स नॉट", "इट्स", "लीडर", "मी", "मोर", "माई", "नीडेड", "नं", "नाउ", "ऑफ", "वन्स", "वन", "ओन्ली", "ऑर", "अदर", "आउअर", "आउट्साइड", "सेम", "सेल्फ", "शि'डी", "शि'एलएल", "शि'स", "शि'स नोट", "सम", "टी", "देम", "देन", "देयर", "दे", "दे'डी", "दे'डी'वे", "दे'एलएल", "दे'एलएल'वे", "दे'रे", "दे'रे नॉट", "दे'वे", "थ्रु", "दज़", "टु", "अंटिल", "वेरी", "वास", "वी'डी", "वी'डी'वे", "वी'एलएल", "वी'एलएल'वे", "वी'रे", "वी'रे नॉट", "वी'वे", "वेंट", "वर", "वॉट", "वेन", "वेयर", "वेरॅज़", "हू", "हूम", "वाय", "यू", "यू'डी", "यू'डी'वे", "यू'एलएल", "यू'एलएल'वे", "यू'रे", "यू'रे नॉट", "यू'वे", "ए", "अबाउट", "अबव", "आफ्टर", "अगेन", "अगेन्स्ड", "ऑल", "एम", "एन", "एंड", "अनादर", "एनी", "आर", "अरन'टी", "अरन'टी ", "एट", "बी", "बिकॉज़", "बीन", "बिफॉर", "बीइंग", "बिलो", "बिट्वीन", "बोथ", "बट", "बाय", "केन", "केन'टी", "केन्नोट", "क्लोज", "कुड", "कौल्द्न'टी", "डिड", "डिडन'टी", "डू", "डज", "डज'टी", "डुइंग", "डॉन'टी", "डाउन", "ड्युअरिंग", "ईच", "एट", "फ्यु", "फाइव", "फोर", "फोर", "फ्रॉम", "फर्दर", "हेड", "हेडन'टी", "हेज़", "हेज़न'टी", "हेव", "हेवन'टी", "हेविंग", "ही'डी", "ही'एलएल", "ही'स", "हर", "हियर", "हियर'एस", "हर्ज़", "हर्सेल्फ", "हिम", "हिमसेल्फ", "हिज़", "हाउ", "हाउ'एस", "आई", "आई'डी", "आई'एलएल", "आई'एम", "आई'वे", "इफ", "इन", "इन्सटेड", "इंटू", "इज़", "इज़'ट", "इट", "इट'स", "इट्स", "इट्सेल्फ", "लैट'स", "मजॉरिटी", "मी", "मोर", "मोस्ट", "मस्ट", "मस्ट्न'ट", "माई", "माइसेल्फ", "नाइदर", "नाइन", "नो", "नोर", "नॉट", "ऑफ", "ऑफ़", "ऑन", "वन्स", "वन", "ओन्ली", "ऑर", "अदर", "ऑट", "आवर्ज़", "आउअर्सेलव्ज़", "आउट", "ओवर", "ओन", "पास", "सेम", "सेवेन", "शॅल", "शान'टी", "शी", "शी'डी", "शी'एलएल", "शी'एस", "शुड", "शुड'टी", "सिक्स", "सो", "सम", "सच", "टेक्स्ट", "देन", "देट", "देट'एस", "द", "देयर", "देयर'एस", "देर्ज़", "देम", "दम्सेलव्ज़", "देन", "देयर", "देयर'रे", "देयर'एस", "दिइस", "दे", "दे'डी", "दे'एलएल", "दे'रे", "दे'वे", "दिस", "दोज़", "थ्री", "थ्रु", "टु", "टु", "टू", "अन्डर", "अंटिल", "अप", "वेरी", "वास", "वासन'टी", "वी", "वी'डी", "वी'एलएल", "वी'रे", "वी'वे", "वर", "वरन'टी", "वॉट", "वॉट'एस", "वेन", "वेन'एस", "वेयर", "वेयर'एस", "विच", "वाइल", "हू", "हू'एस", "हूम", "वाय", "वाय'एस", "विल", "विथ", "वोन'टी", "वुड", "वुडन'टी", "यू", "यॉर'एस", "यॉर्ज़", "यॉरसेल्फ", "ज़ीरो"],
    "mal": ["ഏ", "അബാഉട്", "അബവ", "അഹേഡ്", "അല്‍", "ആന്‍റ്", "അന്യ്", "അരേ", "ആസ്", "ബികçജ", "ബിലോ", "ബോഥ്", "ബട്", "ബാഈ", "കന്", "ക്രീചര", "ഡിജായര", "ഡിഡ്", "ഏവ്രിവന", "ഫസ്റ്റ്", "ഫോര്‍", "ഫ്രം", "ഹãപന്", "ഹി", "ഹി'എല്‍എല്‍", "ഹി'എസ്", "ഹി'എസ് നോട്ട്", "ഹേരേ", "ഹിമ്", "ഹിജ്", "ഹൌ", "ഐ", "ഐ'ദ്", "ഐ'ദ്'വേ", "ഐ'എല്‍എല്‍", "ഐ'എല്‍എല്‍'വേ", "ഐ'എം", "ഐ'എം നോട്ട്", "ഐ'വേ", "ഇഫ്", "ഇന്‍", "ഇജ്", "ഐറ്റി'എസ്", "ഐറ്റി'എസ് നോട്ട്", "ഇട്സ്", "ലീഡര്", "മി", "മോരേ", "മാഈ", "നീഡേഡ്", "നോ", "നൌ", "ഓഫ്", "വന്സ", "വണ്‍", "ഓന്ലി", "ഓര്‍", "അദര്‍", "ആഉഅര്", "ആഉട്സാഇഡ", "സേമ", "സേല്ഫ്", "ശേ'ദ്", "ശേ'എല്‍എല്‍", "ശേ'എസ്", "ശേ'എസ് നോട്ട്", "സോമേ", "തി", "ദേമ്", "ദേന്", "ഠേരേ", "തെയ്", "തെയ്'ദ്", "തെയ്'ദ്'വേ", "തെയ്'എല്‍എല്‍", "തെയ്'എല്‍എല്‍'വേ", "തെയ്'രേ", "തെയ്'രേ നോട്ട്", "തെയ്'വേ", "ത്രൌഘ്", "ദജ്", "ടു", "അംടില്", "വേരി", "വാസ്", "വി'ദ്", "വി'ദ്'വേ", "വി'എല്‍എല്‍", "വി'എല്‍എല്‍'വേ", "വി'രേ", "വി'രേ നോട്ട്", "വി'വേ", "വേംട്", "വര", "വçട്", "വേന്", "വേര", "വേരãജ്", "ഹൂ", "ഹൂമ്", "വാഈ", "യൂ", "യൂ'ദ്", "യൂ'ദ്'വേ", "യൂ'എല്‍എല്‍", "യൂ'എല്‍എല്‍'വേ", "യൂ'രേ", "യൂ'രേ നോട്ട്", "യൂ'വേ", "ഏ", "അബാഉട്", "അബവ", "ആഫ്ടര്‍", "അഗേന്", "അഗേന്സ്ഡ്", "അല്‍", "ആമ്", "ആന്", "ആന്‍റ്", "അനതര്‍", "അന്യ്", "അരേ", "അരേന്'ടി", "അരേന്'ടി ", "®ട്", "ബി", "ബികçജ", "ബീന്", "ബിഫçര", "ബീഇംഗ്", "ബിലോ", "ബിട്വീന്", "ബോഥ്", "ബട്", "ബാഈ", "കന്", "കന്'ടി", "കാന്നോത്", "ക്ലോജ", "കുഡ്", "കൌല്ദ്ന്'ടി", "ഡിഡ്", "ഡിഐഡിഎന്‍'ടി", "ഡൂ", "ദോയസ്", "ഡിഒഇഎസ്എന്‍'ടി", "ഡുഇംഗ്", "ഡോണ്‍'ടി", "ഡൌണ്‍", "ഡൂറിംഗ്", "ഈച്", "ഏട്", "ഫ്യു", "ഫാഇവ", "ഫോര്‍", "ഫോര്", "ഫ്രം", "ഫര്ദര്", "ഹാഡ്", "എച്ച്എഡിഎന്‍'ടി", "ഹãജ്", "എച്ച്എഎസ്എന്‍'ടി", "ഹãവ", "ഹേവന്'ടി", "ഹãവിംഗ്", "ഹി'ദ്", "ഹി'എല്‍എല്‍", "ഹി'എസ്", "ഹേര്", "ഹേരേ", "ഹേരേ'എസ്", "ഹര്ജ്", "ഹര്സേല്ഫ്", "ഹിമ്", "ഹിമസേല്ഫ്", "ഹിജ്", "ഹൌ", "ഹൌ'എസ്", "ഐ", "ഐ'ദ്", "ഐ'എല്‍എല്‍", "ഐ'എം", "ഐ'വേ", "ഇഫ്", "ഇന്‍", "ഇന്സടേഡ്", "ഇംടൂ", "ഇജ്", "ഐഎസ്എന്‍'ടി", "ഐറ്റി", "ഐറ്റി'എസ്", "ഇട്സ്", "ഇട്സേല്ഫ്", "ലൈട്'എസ്", "മജçരിടി", "മി", "മോരേ", "മോസ്ട്", "മസ്ട്", "മുസ്ട്ന്'ടി", "മാഈ", "മാഇസേല്ഫ്", "നാഇദര്", "നാഇന", "നോ", "നോര്‍", "നോട്ട്", "ഓഫ്", "ഓഫ്", "ഓണ്‍", "വന്സ", "വണ്‍", "ഓന്ലി", "ഓര്‍", "അദര്‍", "²ട്", "ആവര്ജ്", "ആഉഅര്സേലവ്ജ്", "ആഉട്", "ഓവര്", "ഓണ്‍", "പാസ്", "സേമ", "സേവേന്", "ശãല്", "ഷാന്‍'ടി", "ശേ", "ശേ'ദ്", "ശേ'എല്‍എല്‍", "ശേ'എസ്", "ശുഡ്", "ശൌല്ദ്ന്'ടി", "സിക്സ്", "സോ", "സോമേ", "സച്ച്", "ടേക്സ്ട്", "ഠാണ്", "തത്", "തത്'എസ്", "തെ", "ദേര്", "ദേര്'എസ്", "ദേര്ജ്", "ദേമ്", "ദമ്സേലവ്ജ്", "ദേന്", "ഠേരേ", "ഠേരേ'രേ", "ഠേരേ'എസ്", "തെസെ", "തെയ്", "തെയ്'ദ്", "തെയ്'എല്‍എല്‍", "തെയ്'രേ", "തെയ്'വേ", "ദിസ്", "ഥോസേ", "ഥ്രി", "ത്രൌഘ്", "ടു", "ടു", "ടൂ", "അന്ഡര്", "അംടില്", "അപ്", "വേരി", "വാസ്", "ഡബ്ളിയുഎഎസ്എന്‍'ടി", "വി", "വി'ദ്", "വി'എല്‍എല്‍", "വി'രേ", "വി'വേ", "വര", "വേരേന്'ടി", "വçട്", "വçട്'എസ്", "വേന്", "വേന്'എസ്", "വേര", "വേര'എസ്", "വിച്", "വാഇല", "ഹൂ", "ഹൂ'എസ്", "ഹൂമ്", "വാഈ", "വാഈ'എസ്", "വില്ല്", "വിത്ത്", "വന്'ടി", "വുഡ്", "വൌല്ദ്ന്'ടി", "യൂ", "യçര്'എസ്", "യçര്ജ്", "യçരസേല്ഫ്", "ഝീരോ"],
    "tam": ["ஏ", "அபாஉட்", "அபவ", "அஹேட்", "ஔல்", "மற்றும்", "அந்ய்", "ஆரே", "ஏஎஸ்", "பிகஆஜ", "பிலோ", "போத்", "பட்", "பாஈ", "கந்", "க்ரீசர", "டிஜாயர", "டிட்", "ஏவ்ரிவந", "ஃபர்ஸ்ட்", "ஃபோர்", "ஃப்ரஆம்", "ஹெபந்", "ஹி", "ஹி'எல்எல்", "ஹி'ஸ்", "ஹி'ஸ் நஆட்", "ஹேரே", "ஹிம்", "ஹிஜ்", "ஹாஉ", "இ", "ஐ'டி", "ஐ'டி'வே", "ஐ'எல்எல்", "ஐ'எல்எல்'வே", "ஐ'ம்", "ஐ'ம் நஆட்", "ஐ'வே", "இஃப்", "இந்", "இஷ்", "ஐடி'ஸ்", "ஐடி'ஸ் நஆட்", "இட்ஸ்", "லீடர்", "மி", "மோரே", "மாஈ", "நீடேட்", "எண்", "நௌ", "ஔஃப்", "வந்ஸ", "வந", "ஓந்லி", "ஓர்", "அதர்", "ஆஉஅர்", "ஆஉட்ஸாஇட", "ஸேம", "ஸேல்ஃப்", "ஷே'டி", "ஷே'எல்எல்", "ஷே'ஸ்", "ஷே'ஸ் நஆட்", "ஸோமே", "டி", "தேம்", "தேன்", "டேரே", "தே", "தே'டி", "தே'டி'வே", "தே'எல்எல்", "தே'எல்எல்'வே", "தே'ரே", "தே'ரே நஆட்", "தே'வே", "த்ரு", "தஜ்", "டு", "அண்டில்", "வேரி", "வாஸ்", "வி'டி", "வி'டி'வே", "வி'எல்எல்", "வி'எல்எல்'வே", "வி'ரே", "வி'ரே நஆட்", "வி'வே", "வேண்ட்", "வர", "வஆட்", "வேந்", "வேர", "வேரெஜ்", "ஹூ", "ஹூம்", "வாஈ", "யூ", "யூ'டி", "யூ'டி'வே", "யூ'எல்எல்", "யூ'எல்எல்'வே", "யூ'ரே", "யூ'ரே நஆட்", "யூ'வே", "ஏ", "அபாஉட்", "அபவ", "ஆஃப்டர்", "அகேந்", "அகேந்ஸ்ட்", "ஔல்", "ஆம்", "அன்", "மற்றும்", "அநாதர்", "அந்ய்", "ஆரே", "அரேந்'டி", "அரேந்'டி ", "ஏட்", "பி", "பிகஆஜ", "பீந்", "பிஃபஆர", "பீஇங்க்", "பிலோ", "பிட்வீந்", "போத்", "பட்", "பாஈ", "கந்", "கந்'டி", "காந்நோத்", "க்லோஜ", "குட்", "கோஉல்ட்ன்'டி", "டிட்", "டிஐடிஎன்'டி", "டூ", "டோஏஸ்", "டிஓஇஎஸ்என்'டி", "டுஇங்க்", "டோண்'டி", "டாஉந்", "ட்யுஅரிங்க்", "ஈச்", "ஏட்", "ஃப்யு", "ஃபாஇவ", "ஃபோர்", "ஃபோர்", "ஃப்ரஆம்", "ஃபர்தர்", "ஹட்", "ஹெச்ஏடிஎன்'டி", "ஹெஜ்", "ஹெச்ஏஎஸ்என்'டி", "ஹெவ", "ஹேவந்'டி", "ஹெவிங்க்", "ஹி'டி", "ஹி'எல்எல்", "ஹி'ஸ்", "ஹேர்", "ஹேரே", "ஹேரே'ஸ்", "ஹர்ஜ்", "ஹர்ஸேல்ஃப்", "ஹிம்", "ஹிமஸேல்ஃப்", "ஹிஜ்", "ஹாஉ", "ஹாஉ'ஸ்", "இ", "இ'டி", "இ'எல்எல்", "இ'ம்", "இ'வே", "இஃப்", "இந்", "இந்ஸடேட்", "இண்டூ", "இஷ்", "ஐஎஸ்என்'டி", "ஐடி", "ஐடி'ஸ்", "இட்ஸ்", "இட்ஸேல்ஃப்", "லைட்'ஸ்", "மஜஆரிடி", "மி", "மோரே", "மோஸ்ட்", "மஸ்ட்", "முஸ்ட்ன்'டி", "மாஈ", "மாஇஸேல்ஃப்", "நாஇதர்", "நாஇந", "எண்", "நோர்", "நஆட்", "ஔஃப்", "ஔஃப்", "ஔந்", "வந்ஸ", "வந", "ஓந்லி", "ஓர்", "அதர்", "ஔட்", "ஆவர்ஜ்", "ஆஉஅர்ஸேலவ்ஜ்", "ஆஉட்", "ஓவர்", "ஓந்", "பாஸ்", "ஸேம", "ஸேவேந்", "ஷெல்", "ஷான்'டி", "ஷே", "ஷே'டி", "ஷே'எல்எல்", "ஷே'ஸ்", "ஷுட்", "ஷோஉல்ட்ன்'டி", "ஸிக்ஸ்", "ஸோ", "ஸோமே", "ஸச்", "டேக்ஸ்ட்", "டாண்", "டட்", "டட்'ஸ்", "தி", "தேர்", "தேர்'ஸ்", "தேர்ஜ்", "தேம்", "தம்ஸேலவ்ஜ்", "தேன்", "டேரே", "டேரே'ரே", "டேரே'ஸ்", "டேஸே", "தே", "தே'டி", "தே'எல்எல்", "தே'ரே", "தே'வே", "திஸ்", "தோஸே", "த்ரி", "த்ரு", "டு", "டு", "டூ", "அந்டர்", "அண்டில்", "அப்", "வேரி", "வாஸ்", "டபிள்யுஏஎஸ்என்'டி", "வி", "வி'டி", "வி'எல்எல்", "வி'ரே", "வி'வே", "வர", "வேரேந்'டி", "வஆட்", "வஆட்'ஸ்", "வேந்", "வேந்'ஸ்", "வேர", "வேர'ஸ்", "விச்", "வாஇல", "ஹூ", "ஹூ'ஸ்", "ஹூம்", "வாஈ", "வாஈ'ஸ்", "வில்", "வித்", "வந்'டி", "வுட்", "வோஉல்ட்ன்'டி", "யூ", "யஆர்'ஸ்", "யஆர்ஜ்", "யஆரஸேல்ஃப்", "ஜீரோ"],
    "tel": ["ఏ", "అబౌట్", "అబవ", "అహెడ్", "అల్లా", "ఆనంద్", "ఎని", "ఆరె", "అస్", "బెకాజ్", "బిలో", "బోత్", "బట్", "బై", "క్యాన్", "క్రీట్యూర్", "డిజైర్", "డిడ్", "ఎవెరోన్", "ఫర్స్ట్", "ఫోర్", "ఫ్రమ్", "హాపన్", "హి", "హి'ఎల్ఎల్", "హి'ఏస్", "హి'ఏస్ నాట్", "హియర్", "హిం", "హిజ్", "హౌ", "ఆఈ", "ఆఇ'డి", "ఆఇ'డి'వే", "ఆఇ'ఎల్ఎల్", "ఆఇ'ఎల్ఎల్'వే", "ఆఇ'ఏమ్", "ఆఇ'ఏమ్ నాట్", "ఆఇ'వే", "ఇఫ్", "ఇన్", "ఇజ్", "ఆఇటి'ఏస్", "ఆఇటి'ఏస్ నాట్", "ఇట్స్", "లీడర్", "మే", "మోరె", "మై", "నీడడ్", "నం", "నౌ", "ఆఫ్", "ఒన్స్", "వన్", "ఓన్లి", "ఆర్", "అదర్", "అవర్", "ఒయుత్సైడ్", "సేమ్", "సెల్ఫ్", "షి'డి", "షి'ఎల్ఎల్", "షి'ఏస్", "షి'ఏస్ నాట్", "సమ్", "టి", "దెమ్", "దెన్", "థెర్", "దే", "దే'డి", "దే'డి'వే", "దే'ఎల్ఎల్", "దే'ఎల్ఎల్'వే", "దే'రే", "దే'రే నాట్", "దే'వే", "త్రూ", "దజ్", "టు", "అంటిల్", "వరి", "వజ్", "వి'డి", "వి'డి'వే", "వి'ఎల్ఎల్", "వి'ఎల్ఎల్'వే", "వి'రే", "వి'రే నాట్", "వి'వే", "వెంట్", "వర్", "వాట్", "వెన్", "వేర్", "వెరీస్", "హూ", "హూమ్", "వై", "యు", "యు'డి", "యు'డి'వే", "యు'ఎల్ఎల్", "యు'ఎల్ఎల్'వే", "యు'రే", "యు'రే నాట్", "యు'వే", "ఏ", "అబౌట్", "అబవ", "అఫటర్", "అగైన్", "అగెయిన్స్ట్", "అల్లా", "అమ్", "అన్", "ఆనంద్", "అనదర్", "ఎని", "ఆరె", "అరేన్'టి", "అరేన్'టి ", "ఏట్", "బే", "బెకాజ్", "బీన్", "బిఫోర్", "బీంగ్", "బిలో", "బిట్వీన్", "బోత్", "బట్", "బై", "క్యాన్", "క్యాన్'టి", "కానోట్", "క్లోజ్", "కుడ్", "కౌల్ద్న్'టి", "డిడ్", "డీఆఇడీఎన్'టి", "డూ", "డజ్", "డీఓఇఎస్ఎన్'టి", "డూయింగ్", "డన్'టి", "డౌన్", "డురింగ్", "ఈచ్", "ఎయిట్", "ఫ్యూ", "ఫైవ్", "ఫోర్", "ఫోర్", "ఫ్రమ్", "ఫుర్తర్", "హాడ్", "హెచ్ఎడీఎన్'టి", "హాజ్", "హస్న్'టి", "హావ్", "హవెన్'టి", "హావింగ్", "హి'డి", "హి'ఎల్ఎల్", "హి'ఏస్", "హర్", "హియర్", "హియర్'ఏస్", "హర్స్", "హెర్సెల్ఫ్", "హిం", "హిమసెల్ఫ్", "హిజ్", "హౌ", "హౌ'ఏస్", "ఆఈ", "ఆఈ'డి", "ఆఈ'ఎల్ఎల్", "ఆఈ'ఏమ్", "ఆఈ'వే", "ఇఫ్", "ఇన్", "ఇన్‌స్టీడ్", "ఇంటు", "ఇజ్", "ఆఇఎస్ఎన్'టి", "ఆఇటి", "ఆఇటి'ఏస్", "ఇట్స్", "ఇత్సెల్ఫ్", "లెట్'ఏస్", "మాజోరిటి", "మే", "మోరె", "మోస్ట్", "మస్ట్", "ముస్ట్న్'టి", "మై", "మిసెల్ఫ్", "నైదర్", "నైన్", "నం", "నార్", "నాట్", "ఆఫ్", "ఆఫ్", "ఆన్", "ఒన్స్", "వన్", "ఓన్లి", "ఆర్", "అదర్", "ఆట్", "అవర్స్", "అవర్‌సెల్వ్స్", "ఔట్", "ఓవర్", "ఓన్", "పాస్", "సేమ్", "సెవన్", "షల్", "శన్'టి", "షి", "షి'డి", "షి'ఎల్ఎల్", "షి'ఏస్", "షుడ్", "శౌల్ద్న్'టి", "సిక్స్", "సొ", "సమ్", "సచ్", "టెక్స్ట్", "దేన్", "దట్", "దట్'ఏస్", "ది", "దెయిర్", "దెయిర్'ఏస్", "థైర్స్", "దెమ్", "థెమసెల్వెస్", "దెన్", "థెర్", "థెర్'రే", "థెర్'ఏస్", "దీజ్", "దే", "దే'డి", "దే'ఎల్ఎల్", "దే'రే", "దే'వే", "థిస్", "దోజ్", "థ్రి", "త్రూ", "టు", "టూ", "టూ", "అండర్", "అంటిల్", "అప్", "వరి", "వజ్", "డబల్ యూఎఎస్ఎన్'టి", "వి", "వి'డి", "వి'ఎల్ఎల్", "వి'రే", "వి'వే", "వర్", "వేరేన్'టి", "వాట్", "వాట్'ఏస్", "వెన్", "వెన్'ఏస్", "వేర్", "వేర్'ఏస్", "విచ్", "వైల్", "హూ", "హూ'ఏస్", "హూమ్", "వై", "వై'ఏస్", "విల్", "విత్", "వన్'టి", "వుడ్", "వౌల్ద్న్'టి", "యు", "యౌర్'ఏస్", "యువర్స్", "యోర్సెల్ఫ్", "ఝీరొ"],
    "urd": [
        "آئی",
        "مے",
        "مائيِ",
        "سیلف",
        "آئُارَ",
        "ويِ",
        "آئُارَسَیلَوَض",
        "يوُ",
        "يَوَرَض",
        "يَوَرَسَیلَفھ",
        "ہی",
        "ہیم",
        "حیس",
        "شَے",
        "ہرَسَیلَفھ",
        "آئی ٹی ",
        "اِٹسَ",
        "دَے",
        "دَیمَ",
        "دَیرَ",
        "دَیرَ'ایس",
        "وَوَٹ",
        "ہُو",
        "ہُومَ",
        "اِن",
        "اِس",
        "ارے",
        "واسَ",
        "وَرَ",
        "ہوپَنَ",
        "وَیںٹ",
        "کريِچَرَ",
        "پسّ",
        "ٹو",
        "ڈو",
        "دوءیس",
        "دید",
        "ڈُئِںگَ",
        "اے",
        "وَنَ",
        "عند",
        "بَٹ",
        "اِف",
        "ئوَرَ",
        "بِکوَض",
        "آس",
        "اَںٹِلَ",
        "وَیرَوض",
        "اوف",
        "بائيِ",
        "فھورَ",
        "وِتھ",
        "اَبائُٹ",
        "دِسَ",
        "اَگَینَسَڈ",
        "بِٹوین",
        "تھرُ",
        "ڈيُارِںگَ",
        "فھرَسَٹ",
        "آفھٹرَ",
        "اَبَوَ",
        "بِلو",
        "ٹو",
        "فھرَوَمَ",
        "آئُٹسائِڈ",
        "کلوجَ",
        "اَنَڈرَ",
        "اَگَینَ",
        "احد",
        "دَینَ",
        "وَنَسَ",
        "ہیرے",
        "ٹھیرَے",
        "وَینَ",
        "وَیرَ",
        "وائيِ",
        "ہائُ",
        "علل",
        "انی",
        "بوت",
        "ايوَرِوَنَ",
        "سومَے",
        "مورے",
        "مَجَوَرِٹی",
        "اوف",
        "اوتھر",
        "دَض",
        "نمبر",
        "عند",
        "نائِدَرَ",
        "اونَليِ",
        "اونَ",
        "سمی",
        "سو",
        "اِنَسَٹیڈ",
        "وَیريِ",
        "ٹی",
        "کنَ",
        "ڈِضايَرَ",
        "نو",
        "ليِڈرَ",
        "نيِڈیڈ",
        "اَنادَرَ",
        "ٹیکسَٹ",
        "ٹھی",
        "آئی 'ایم",
        "يوُ'رَے",
        "ہی'ایس",
        "شَے'ایس",
        "آئی ٹی 'ایس",
        "ويِ'رَے",
        "دَے'رَے",
        "آئی 'ایل ایل ",
        "يوُ'ایل ایل ",
        "ہی'ایل ایل ",
        "شَے'ایل ایل ",
        "ويِ'ایل ایل ",
        "دَے'ایل ایل ",
        "آئی 'وَے",
        "يوُ'وَے",
        "ويِ'وَے",
        "دَے'وَے",
        "آئی 'ڈی",
        "يوُ'ڈی",
        "شَے'ڈی",
        "ويِ'ڈی",
        "دَے'ڈی",
        "آئی 'ایل ایل 'وَے",
        "يوُ'ایل ایل 'وَے",
        "ويِ'ایل ایل 'وَے",
        "دَے'ایل ایل 'وَے",
        "آئی 'ڈی'وَے",
        "يوُ'ڈی'وَے",
        "ويِ'ڈی'وَے",
        "دَے'ڈی'وَے",
        "آئی 'ایم نَوَٹ",
        "يوُ'رَے نَوَٹ",
        "ہی'ایس نَوَٹ",
        "شَے'ایس نَوَٹ",
        "آئی ٹی 'ایس نَوَٹ",
        "ويِ'رَے نَوَٹ",
        "دَے'رَے نَوَٹ",
        "وِلَ",
        "شَولَ",
        "اِس",
        "عام",
        "يوُ",
        "يَوَرَ'ایس",
        "ٹھیرَے'رَے",
        "اے",
        "اَبائُٹ",
        "اَبَوَ",
        "علل",
        "اں",
        "انی",
        "ارے",
        "اَرَینَ'ٹی",
        "عت",
        "بے",
        "بِکوَض",
        "بین",
        "بِفھوَرَ",
        "بيِئِںگَ",
        "بِلو",
        "بوت",
        "بَٹ",
        "بائيِ",
        "کنَ",
        "کنَ'ٹی",
        "کانّوتَ",
        "کُڈ",
        "چاُلدن'ٹی",
        "دید",
        "ڈی آئی ڈی این 'ٹی",
        "ڈی او ای ایس این 'ٹی",
        "ڈون'ٹی",
        "دون",
        "اِیچَ",
        "فھيُ",
        "فھورَ",
        "فھرَوَمَ",
        "فھرَدَرَ",
        "حد",
        "ایچ ﻿اے ڈی این 'ٹی",
        "حسں",
        "ہسن'ٹی",
        "ہووَ",
        "ہیوَنَ'ٹی",
        "ہووِںگَ",
        "ہی'ڈی",
        "ہی'ایل ایل ",
        "ہی'ایس",
        "ہر",
        "ہیرے",
        "ہیرے'ایس",
        "ہرَض",
        "ہیم",
        "ہِمَسَیلَفھ",
        "حیس",
        "ہائُ",
        "ہائُ'ایس",
        "آئی",
        "آئی'ڈی",
        "آئی'ایل ایل ",
        "آئی'ایم",
        "آئی'وَے",
        "اِف",
        "اِن",
        "اِںٹُو",
        "آئی ایس این 'ٹی",
        "آئی ٹی 'ایس",
        "اِٹسَ",
        "اِٹسَیلَفھ",
        "لیت'ایس",
        "مے",
        "مورے",
        "موسَٹ",
        "مَسَٹ",
        "مُستان'ٹی",
        "مائيِ",
        "مائِسَیلَفھ",
        "نمبر",
        "نور",
        "نَوَٹ",
        "ئوَفَ",
        "اون",
        "وَنَسَ",
        "اونَليِ",
        "ئوَرَ",
        "اوتھر",
        "ئوَٹ",
        "آوَرَض",
        "آئُٹ",
        "اووَرَ",
        "سمی",
        "شان'ٹی",
        "شَے'ڈی",
        "شَے'ایل ایل ",
        "شَے'ایس",
        "شُڈ",
        "شاُلدن'ٹی",
        "سومَے",
        "سچ",
        "تھان",
        "ٹھٹ",
        "ٹھٹ'ایس",
        "دَیرَض",
        "دَیمَ",
        "دَمَسَیلَوَض",
        "دَینَ",
        "ٹھیرَے",
        "ٹھیرَے'ایس",
        "ٹھیسَے",
        "دَے",
        "دَے'ڈی",
        "دَے'ایل ایل ",
        "دَے'رَے",
        "دَے'وَے",
        "تھوسَے",
        "تھرُ",
        "ٹو",
        "اَںٹِلَ",
        "اوپ",
        "وَیريِ",
        "واسَ",
        "ڈبلیو ﻿اے ایس این 'ٹی",
        "ويِ'ڈی",
        "ويِ'ایل ایل ",
        "ويِ'رَے",
        "ويِ'وَے",
        "وَرَ",
        "وَیرَینَ'ٹی",
        "وَوَٹ",
        "وَوَٹ'ایس",
        "وَینَ",
        "وَینَ'ایس",
        "وَیرَ",
        "وَیرَ'ایس",
        "وِچَ",
        "وائِلَ",
        "ہُو",
        "ہُو'ایس",
        "ہُومَ",
        "وائيِ",
        "وائيِ'ایس",
        "وَنَ'ٹی",
        "وُڈ",
        "واُلدن'ٹی",
        "اَرَینَ'ٹی ",
        "جھيِرو",
        "وَنَ",
        "ٹُو",
        "تھريِ",
        "فور",
        "فھائِوَ",
        "سِکسَ",
        "سَیوَینَ",
        "ايٹ",
        "نائِنَ"
    ],
    "ori": ["ଅ", "ଅବାଉଟ", "ଅବଵ", "ଅହେଡ", "ଓଲ", "ଆଣ୍ଡ", "ଅନ୍ଯ", "ଆରେ", "ଆସ", "ବିକୌଜ଼", "ବିଲୋ", "ବୋଥ", "ବୁଟ", "ବାଈ", "କନ", "କ୍ରୀଚର", "ଡିଜ଼ାଯର", "ଡିଡ", "ଏଵ୍ରିଵନ", "ଫର୍ସ୍ଟ", "ଫୋର", "ଫ୍ରୌମ", "ହେପନ", "ହେ", "ହେ'ଏଲଏଲ", "ହେ'ସ", "ହେ'ସ ନୌଟ", "ହେରେ", "ହିମ", "ହିଜ଼", "ହାଓ", "ଇ", "ଆଇ'ଡ", "ଆଇ'ଡ'ଵେ", "ଆଇ'ଏଲଏଲ", "ଆଇ'ଏଲଏଲ'ଵେ", "ଆଇ'ମ", "ଆଇ'ମ ନୌଟ", "ଆଇ'ଵେ", "ଇଫ", "ଇନ", "ଇସ୍", "ଇତ'ସ", "ଇତ'ସ ନୌଟ", "ଇଟ୍ସ", "ଲୀଡର", "ମେ", "ମୋରେ", "ମାଈ", "ନୀଡେଡ", "ନଂ", "ନୌ", "ଓଫ", "ଵନ୍ସ", "ଵନ", "ଓନ୍ଲୀ", "ଓର", "ଅଦର", "ଆଉଅର", "ଆଉଟ୍ସାଇଡ", "ସମେ", "ସେଲ୍ଫ", "ଶେ'ଡ", "ଶେ'ଏଲଏଲ", "ଶେ'ସ", "ଶେ'ସ ନୌଟ", "ସୋମେ", "ଟୀ", "ଦେମ", "ଦେନ", "ଠେରେ", "ଦେ", "ଦେ'ଡ", "ଦେ'ଡ'ଵେ", "ଦେ'ଏଲଏଲ", "ଦେ'ଏଲଏଲ'ଵେ", "ଦେ'ରେ", "ଦେ'ରେ ନୌଟ", "ଦେ'ଵେ", "ଥ୍ରୁ", "ଠୁସ", "ଟୁ", "ଅଂଟିଲ", "ଵେରୀ", "ଵାସ", "ଵୀ'ଡ", "ଵୀ'ଡ'ଵେ", "ଵୀ'ଏଲଏଲ", "ଵୀ'ଏଲଏଲ'ଵେ", "ଵୀ'ରେ", "ଵୀ'ରେ ନୌଟ", "ଵୀ'ଵେ", "ଵେଂଟ", "ଵର", "ଵୌଟ", "ଵେନ", "ଵେର", "ଵେରେଜ଼", "ହୂ", "ହୂମ", "ଵାଈ", "ଯୂ", "ଯୂ'ଡ", "ଯୂ'ଡ'ଵେ", "ଯୂ'ଏଲଏଲ", "ଯୂ'ଏଲଏଲ'ଵେ", "ଯୂ'ରେ", "ଯୂ'ରେ ନୌଟ", "ଯୂ'ଵେ", "ଅ", "ଅବାଉଟ", "ଅବଵ", "ଆଫ୍ଟର", "ଅଗେନ", "ଅଗେନ୍ସ୍ଡ", "ଓଲ", "ଆମ", "ଅନ", "ଆଣ୍ଡ", "ଅନାଦର", "ଅନ୍ଯ", "ଆରେ", "ଅରେନ'ଟୀ", "ଅରେନ'ଟୀ ", "ଅତ", "ବେ", "ବିକୌଜ଼", "ବୀନ", "ବିଫୌର", "ବୀଇଂଗ", "ବିଲୋ", "ବିଟ୍ଵୀନ", "ବୋଥ", "ବୁଟ", "ବାଈ", "କନ", "କନ'ଟୀ", "କାନ୍ନୋତ", "କ୍ଲୋଜ", "କୁଡ", "କୌଲ୍ଦ୍ନ'ଟୀ", "ଡିଡ", "ଡିଆଇଡିଏନ୍'ଟୀ", "ଦୋ", "ଦୋଯସ", "ଡିଓଇଏସ୍ଏନ୍'ଟୀ", "ଡୁଇଂଗ", "ଦୋନ'ଟୀ", "ଡାଉନ", "ଡ୍ଯୁଅରିଂଗ", "ଈଚ", "ଏଟ", "ଫ୍ଯୁ", "ଫାଇଵ", "ଫୋର", "ଫୋର", "ଫ୍ରୌମ", "ଫର୍ଦର", "ହାଡ", "ଏଚ୍ଏଡିଏନ୍'ଟୀ", "ହସ", "ଏଚ୍ଏଏସ୍ଏନ୍'ଟୀ", "ହେଵ", "ହେଵନ'ଟୀ", "ହେଵିଂଗ", "ହେ'ଡ", "ହେ'ଏଲଏଲ", "ହେ'ସ", "ହେର", "ହେରେ", "ହେରେ'ସ", "ହର୍ଜ଼", "ହର୍ସେଲ୍ଫ", "ହିମ", "ହିମସେଲ୍ଫ", "ହିଜ଼", "ହାଓ", "ହାଓ'ସ", "ଇ", "ଇ'ଡ", "ଇ'ଏଲଏଲ", "ଇ'ମ", "ଇ'ଵେ", "ଇଫ", "ଇନ", "ଇନ୍ସଟେଡ", "ଇଂଟୂ", "ଇସ୍", "ଆଇଏସ୍ଏନ୍'ଟୀ", "ଇତ", "ଇତ'ସ", "ଇଟ୍ସ", "ଇଟ୍ସେଲ୍ଫ", "ଲେତ'ସ", "ମଜୌରିଟୀ", "ମେ", "ମୋରେ", "ମୋସ୍ଟ", "ମସ୍ଟ", "ମୁସ୍ଟ୍ନ'ଟୀ", "ମାଈ", "ମାଇସେଲ୍ଫ", "ନାଇଦର", "ନାଇନ", "ନଂ", "ନୋର", "ନୌଟ", "ଓଫ", "ଓଫ଼", "ଓଁ", "ଵନ୍ସ", "ଵନ", "ଓନ୍ଲୀ", "ଓର", "ଅଦର", "ଓଟ", "ଆଵର୍ଜ଼", "ଆଉଅର୍ସେଲଵ୍ଜ଼", "ଆଉଟ", "ଓଵର", "ଓନ", "ପାସ", "ସମେ", "ସେଵେନ", "ଶେଲ", "ଶନ'ଟୀ", "ଶେ", "ଶେ'ଡ", "ଶେ'ଏଲଏଲ", "ଶେ'ସ", "ଶୁଡ", "ଶୌଲ୍ଦ୍ନ'ଟୀ", "ସିକ୍ସ", "ସୋ", "ସୋମେ", "ସଚ", "ଟେକ୍ସ୍ଟ", "ଠଣ", "ଥାଟ", "ଥାଟ'ସ", "ଦ", "ଦେର", "ଦେର'ସ", "ଦେର୍ଜ଼", "ଦେମ", "ଦମ୍ସେଲଵ୍ଜ଼", "ଦେନ", "ଠେରେ", "ଠେରେ'ରେ", "ଠେରେ'ସ", "ଠେସେ", "ଦେ", "ଦେ'ଡ", "ଦେ'ଏଲଏଲ", "ଦେ'ରେ", "ଦେ'ଵେ", "ଦିସ", "ଥୋସେ", "ଥ୍ରୀ", "ଥ୍ରୁ", "ଟୁ", "ଟୁ", "ଟୂ", "ଅନ୍ଡର", "ଅଂଟିଲ", "ଉପ", "ଵେରୀ", "ଵାସ", "ଡବ୍ଲ୍ୟୁଏଏସ୍ଏନ୍'ଟୀ", "ଵୀ", "ଵୀ'ଡ", "ଵୀ'ଏଲଏଲ", "ଵୀ'ରେ", "ଵୀ'ଵେ", "ଵର", "ଵେରେନ'ଟୀ", "ଵୌଟ", "ଵୌଟ'ସ", "ଵେନ", "ଵେନ'ସ", "ଵେର", "ଵେର'ସ", "ଵିଚ", "ଵାଇଲ", "ହୂ", "ହୂ'ସ", "ହୂମ", "ଵାଈ", "ଵାଈ'ସ", "ଵିଲ", "ଵିଥ", "ଵନ'ଟୀ", "ଵୁଡ", "ଵୌଲ୍ଦ୍ନ'ଟୀ", "ଯୂ", "ଯୌର'ସ", "ଯୌର୍ଜ଼", "ଯୌରସେଲ୍ଫ", "ଝୀରୋ"]
};


export class Transliteration {
    constructor(srcVocab, tgtVocab, encoderPath, decoderPath) {

        this.srcVocab = new Vocabulary(srcVocab, false);
        this.tgtVocab = new Vocabulary(tgtVocab, true);
        this.encoderPath = encoderPath
        this.decoderPath = decoderPath
        this.encoder = null;
        this.decoder = null;
        this.cache = cache

        // this.initialize(encoderPath, decoderPath);
    }

    async initialize() {
        try {

            // console.log(this.encoderPath,this.decoderPath)
            this.encoder = await ort.InferenceSession.create("https://github.com/Ssid7647/Portfolio/blob/main/public/model/bhartiya.encoder.quant.onnx");
            console.log(this.encoder)
            this.decoder = await ort.InferenceSession.create("https://github.com/Ssid7647/Portfolio/blob/main/public/model/bhartiya.decoder.quant.onnx");
            console.log(this.decoder)
            // this.cache = new RedisCache(this.langCode, { REDISPORT: 6379 });
        } catch (error) {
            console.error(error);
            throw error;
        }
    }


    isNumber = function (str, dotPos) {
        try {

            if (str === null || typeof str === "undefined" || str.length === 0) {
                return false
            }
            if (dotPos) {
                str = str.slice(dotPos - 1, dotPos + 2)
            }
            if (typeof str !== "string") {
                str = str.toString()
            }

            if (str.endsWith(".") || str.endsWith("!") || str.endsWith("?")) {
                str = str.slice(0, str.length - 1)
            }
            const regexp = /^[+|-]{0,1}(\p{Number})+(\.(\p{Number})+)*/gum
            if (str.replaceAll(",", "").match(regexp)[0].length === str.replaceAll(",", "").length) {
                return true
            }

            return false
        } catch (error) {

            return false
        }
    };


    containsSpecialCharacters(word) {
        // Regular expression to match special characters
        // const regex = /[\[\]!@#$%^&*(),.?":{}|<>]/;
        const regex = /[\p{P}|\||`|<|>|^|~|$|+]/gum

        // Test if the word contains any special characters
        return regex.test(word);
    }

    async transliterate(word, beamWidth, target) {
        try {
            const maxLength = 50;
            if (word.length === 0) return [""];
            if (word.length > maxLength) return ["Max length exceeds...!!!"];

            if (this.containsSpecialCharacters(word) === true || this.isNumber(word) == true) {
                if (this.cache.eng.includes(word)) {
                    return [this.cache[target][this.cache["eng"].indexOf(word)]]
                }
                else {
                    return [word]
                }
            }

            if (this.cache.eng.includes(word)) {
                return [this.cache[target][this.cache["eng"].indexOf(word)]]
            }

            const inVector = this.srcVocab.word2xlitvec(word, target);
            const startToken = inVector[0];
            const endToken = inVector[inVector.length - 1];
            const src = new ort.Tensor('int32', inVector, [1, inVector.length]);

            const inputData = {
                "x": src,
                "x_sz": new ort.Tensor("int32", [inVector.length])
            };

            const { output, h0, c0 } = await this.encoder.run(inputData);
            let topPredList = [[0, [startToken], [h0, c0]]];

            for (let i = 0; i < inVector.length + 10; i++) {
                let currentPredictionList = [];

                for (const ptup of topPredList) {
                    if (ptup[1][ptup[1].length - 1] === endToken) {
                        currentPredictionList.push(ptup);
                        continue;
                    }

                    const x = new Int32Array([ptup[1][ptup[1].length - 1]]);
                    const decoderInput = {
                        "x": new ort.Tensor("int32", x, [1, 1]),
                        "h0": ptup[2][0],
                        "c0": ptup[2][1],
                        "encoder_output": output
                    };
                    const { decoder_output, h1, c1 } = await this.decoder.run(decoderInput);

                    // const putput = await this.decoder.run(decoderInput);
                    // console.log(putput)
                    const predTopK = this.topK(this.logSoftmax(this.reshapeTensor(decoder_output)[0]), 5);

                    for (let x = 0; x < beamWidth; x++) {
                        const sigLogsmx = ptup[0] + predTopK.values[x];
                        const relativeScoreIndex = [...ptup[1], predTopK.indices[x]];
                        currentPredictionList.push([sigLogsmx, relativeScoreIndex, [h1, c1]]);
                    }
                }

                currentPredictionList.sort((a, b) => b[0] - a[0]);
                topPredList = currentPredictionList.slice(0, beamWidth);

                const sumEndFlags = topPredList.reduce((acc, ptup) => acc + (ptup[1][ptup[1].length - 1] === endToken ? 1 : 0), 0);

                if (sumEndFlags === beamWidth) break;
            }

            return topPredList.map(ptup => this.tgtVocab.xlitvec2word(ptup[1]));
        } catch (error) {
            console.error(error);
            return null;
        }
    }

    reshapeTensor(tensor) {
        const { dims } = tensor;
        const data = tensor.cpuData;
        const nestedArrays = [];
        let dataIndex = 0;

        for (let i = 0; i < dims[0]; i++) {
            const row = [];
            for (let j = 0; j < dims[1]; j++) {
                row.push(Number(data[dataIndex++]));
            }
            nestedArrays.push(row);
        }

        return nestedArrays;
    }

    logSoftmax(tensor) {
        const maxVal = Math.max(...tensor);
        const shifted = tensor.map(value => value - maxVal);
        const expValues = shifted.map(value => Math.exp(value));
        const expSum = expValues.reduce((acc, cur) => acc + cur, 0);
        const softmaxValues = expValues.map(value => value / expSum);
        const logSoftmaxValues = softmaxValues.map(value => Math.log(value));
        return logSoftmaxValues;
    }

    topK(array, k) {
        if (k < 0 || k > array.length) {
            throw new Error('Invalid value of k');
        }

        const indices = Array.from({ length: array.length }, (_, index) => index);
        indices.sort((a, b) => array[b] - array[a]);

        const topKIndices = indices.slice(0, k);
        const topKValues = topKIndices.map(index => array[index]);

        return { indices: topKIndices, values: topKValues };
    }
}





// (async() => {
//     let stopwords = [
//         "I",
//         "Me",
//         "My",
//         "Self",
//         "We",
//         "Our",
//         "Our",
//         "we",
//         "ourselves",
//         "You",
//         "yours",
//         "yours",
//         "yourself",
//         "Self",
//         "He",
//         "Him",
//         "His",
//         "she",
//         "herself",
//         "He",
//         "His",
//         "His",
//         "Self",
//         "it",
//         "Its",
//         "yourself",
//         "They",
//         "Them",
//         "their",
//         "their's",
//         "Self",
//         "What",
//         "Who",
//         "Who",
//         "Whom",
//         "it",
//         "He",
//         "In",
//         "They",
//         "forenoon",
//         "Is",
//         "Are",
//         "Was",
//         "Were",
//         "Happen",
//         "Went",
//         "Creature",
//         "pass",
//         "Is",
//         "Was",
//         "Happen",
//         "to",
//         "do",
//         "does",
//         "Did",
//         "doing",
//         "A",
//         "One",
//         "And",
//         "But",
//         "If",
//         "Or",
//         "Because",
//         "As",
//         "Until",
//         "Whereas",
//         "Of",
//         "But",
//         "By",
//         "For",
//         "with",
//         "About this",
//         "against",
//         "between",
//         "In",
//         "Through",
//         "during",
//         "First",
//         "after",
//         "Above",
//         "Below",
//         "To",
//         "From",
//         "Above",
//         "Below",
//         "In",
//         "Outside",
//         "But",
//         "to close",
//         "Above",
//         "under",
//         "again",
//         "Ahead",
//         "Then",
//         "Once",
//         "Here",
//         "There",
//         "When",
//         "Where",
//         "Why",
//         "How",
//         "All",
//         "Any",
//         "Both",
//         "Everyone",
//         "Some",
//         "More",
//         "majority", "of",
//         "Other",
//         "Some",
//         "Thus",
//         "No",
//         "and neither",
//         "No",
//         "Only",
//         "own",
//         "Same",
//         "so",
//         "instead",
//         "Very",
//         "Very",
//         "Tea",
//         "Can",
//         " do",
//         "Desire",
//         "Now!",
//         "Leader",
//         "Needed",
//         "Now"
//     ]

//     let transliteration = new Transliteration()
// })()